{"data":{"repository":{"discussions":{"nodes":[{"title":"Handy with Moonshine","body":"Replace Whisper with Moonshine, which seems like a smaller model and quite efficient","comments":{"nodes":[{"body":"Looks like Moonshine is already supported.","author":{"login":"stalluri"}}]},"category":{"name":"General"},"number":891,"createdAt":"2026-02-25T03:14:02Z"},{"title":"Have ideas for a shortcut?! Post here!","body":"This is a thread for collecting ideas for other shortcuts that you might want in handy that right now are not supported, but may be supported in the future when we can figure them out in a nice unified way across the application and code base, as well as in the UI and user experience.","comments":{"nodes":[{"body":"The ones from the [handy-cli](https://github.com/cjpais/handy-cli) script seemed nice to me. The three remaining ones are:\r\n- generate code\r\n- execute commands\r\n- get AI assistance with context","author":{"login":"tachyonicbytes"}},{"body":"As I suggested [here](https://github.com/cjpais/Handy/discussions/223), I would like to see these additional shortcuts:\r\n\r\n- Shortcut 1: Standard transcription, as it's now.\r\n- Shortcut 2: Transcription with a space at the end of the sentence, after the period.\r\n- Shortcut 3: Transcription with translation (into English for supported models).\r\n\r\nThis would allow anyone to simply do what they need to do without interacting with the user interface.\r\nAnd Handy would become even more handy. 👍","author":{"login":"28Black"}},{"body":"This sort of a bug report but not for you Mac folks -> on Windows, ctrl+v fails in a lot of situations but shift+insert works universally. For example in ssh terminals.\r\n```\r\n--- a/src-tauri/src/clipboard.rs\r\n+++ b/src-tauri/src/clipboard.rs\r\n@@\r\n-   #[cfg(target_os = \"windows\")]\r\n-   let (modifier_key, v_key_code) = (Key::Control, Key::Other(0x56)); // VK_V\r\n+   #[cfg(target_os = \"windows\")]\r\n+   let (modifier_key, v_key_code) = (Key::Shift, Key::Other(0x2D)); // VK_INSERT\r\n```\r\n","author":{"login":"mvsite"}},{"body":"It would be useful if users could assign custom keyboard shortcuts. After pressing a key and speaking, Handy would run a user-defined command, provide the spoken text as STDIN, and then insert the text from STDOUT at the cursor position. This would allow users to implement their own logic to process the input.\r\n\r\nFor example, a user could use this to create a custom voice assistant using an LLM and MCP, leveraging the software's full potential.","author":{"login":"immofon"}},{"body":"I would love to use mouse keys ! Like Middle+Right click","author":{"login":"Damocles-fr"}},{"body":"# self-serve keybinding suggestion\r\nHow are you overriding global keybindings across the many actively used Linux environments? If you use [XDG Global Shortcuts](https://flatpak.github.io/xdg-desktop-portal/docs/doc-org.freedesktop.portal.GlobalShortcuts.html) that should work on recent Wayland versions GNOME and KDE, but there are many others where it will not work.\r\n\r\nIt may be easier to offer an \"outlet valve\" in the form of a command that has the same effect as the keybinding. Then all Linux users can bind to that command, no matter what kind of environment they're running.\r\n\r\nThe command would start/stop transcription - I don't think push-to-talk is viable this way.","author":{"login":"wrycode"}},{"body":"Ability to change language depending on the shortcut.\r\nFor example, first shortcut will assume that you are speaking in English, second shortcut will assume you speak in other language.","author":{"login":"byme8"}},{"body":"Thanks a lot for Handy ! (discovered this week)\r\nI run it on Windows and default Handy shortcut is in conflict with Windows defined shortcuts. The most annoying one is the selection of Excel Table Columns.  Changing it would be useful indeed!\r\n","author":{"login":"jgranduel"}},{"body":"### **1. Separate keyboard shortcuts**\r\n\r\nAdd two different hotkeys:\r\n\r\n* **Shortcut A → Raw transcription**\r\n* **Shortcut B → Transcription + post-processing**\r\n\r\nThis would allow instant switching based on context without toggling settings each time.\r\n\r\n---\r\n\r\n### **2. Multiple post-processing profiles (user-defined)**\r\n\r\nLet users create several post-processing profiles, for example:\r\n\r\n* “Email — professional tone”\r\n* “WhatsApp — casual”\r\n* “Bug report formatter”\r\n* “Summarize”\r\n* “Meeting notes”\r\n\r\n---\r\n\r\n### **3. Profile selection before / during / after recording**\r\n\r\nWhen starting a *post-processed* transcription, allow choosing which profile will be used.\r\n\r\nPossible UX:\r\n\r\n* A small dropdown next to the recording box, showing the currently selected post-processing profile\r\n* Default profile selected automatically\r\n* Optional: Changing the profile while recording updates the one used for the final output\r\n\r\nThis provides maximum convenience and avoids breaking the flow when switching contexts often.","author":{"login":"Puma7"}},{"body":"Shortcut switch on/off for \"Translate to English\"  would be really useful","author":{"login":"Artur3d"}},{"body":"I would love a smart Push-to-Talk option, where it enables Push-to-Talk mode if the shortcut is held vs pressed. Something like:\r\n- keydown + keyup within _n_ ms: toggle recording until shortcut is pressed again\r\n- keydown, no keyup within _n_ ms: record until keyup\r\n","author":{"login":"NickChristensen"}},{"body":"If it's an extra feature, I would love to be able to have a mix of two languages in a sentence. Otherwise, a keyboard shortcut to toggle between two most commonly used languages would be ideal. ","author":{"login":"g33khubber"}},{"body":"I'm using Handy on Pop!_OS with COSMIC (Wayland). Since Wayland doesn't allow apps to register global shortcuts the same way X11 does, I'm using the signal approach mentioned in the docs.\r\n\r\nFor anyone else on COSMIC, you can add a global shortcut by editing:\r\n\r\n`~/.config/cosmic/com.system76.CosmicSettings.Shortcuts/v1/custom`\r\n\r\n```ron\r\n{\r\n    (\r\n        modifiers: [\r\n            Ctrl,\r\n        ],\r\n        key: \"space\",\r\n        description: Some(\"Toggle Handy Recording\"),\r\n    ): Spawn(\"pkill -USR2 -xo handy\"),\r\n}\r\n```\r\n\r\nThe toggle shortcut works great. However, I'd also like a way to **cancel** a recording without transcribing/pasting, similar to pressing Escape when the app is focused. Would it be possible to add another signal (e.g. SIGUSR1) for this?\r\n\r\nThat would allow:\r\n- `SIGUSR2` → toggle recording (existing)\r\n- `SIGUSR1` → cancel recording (new)\r\n\r\nThis is what I'd like to do in the future:\r\n\r\n```ron\r\n(\r\n    modifiers: [\r\n        Ctrl,\r\n        Shift,\r\n    ],\r\n    key: \"space\",\r\n    description: Some(\"Cancel Handy Recording\"),\r\n): Spawn(\"pkill -USR1 -xo handy\"),\r\n```\r\n\r\nThank you for the very Handy app.","author":{"login":"kurisu-dotto-komu"}},{"body":"Please allow a modifier to be the short cut key (without needing to install Karabiner or anything else). In this case, right option key on MacOS.\r\n\r\nExample in Paraspeech:\r\n<img width=\"442\" height=\"59\" alt=\"image\" src=\"https://github.com/user-attachments/assets/3ba9084e-03a0-4034-b1d6-aa3bdf42282f\" />\r\n\r\nBut attempting to set that in Handy gives an error:\r\n<img width=\"385\" height=\"105\" alt=\"image\" src=\"https://github.com/user-attachments/assets/9cc02742-17c3-44a5-bcf3-dd6f245fabe5\" />\r\n","author":{"login":"jasongitmail"}},{"body":"What I would really like is a way to make it hit enter after the transcription automatically. The goal is to make any LLM coding tool to start right away after transcribing and no need for me to hit enter","author":{"login":"benedikt-schesch"}},{"body":"I would like to be able to use the fn key. What's most important to me right now is to be able to use a single key instead of having to press two. This is a standard feature in most other such applications. Thanks for a response on this. Otherwise I absolutely love the app and its simplicity. Everything that's needed is there.\r\n\r\nEdit: I see this has been addressed in #580 already. Hope it gets pushed to main soon. I'm using that build and it works great.","author":{"login":"dudemeister23"}},{"body":"> This is a thread for collecting ideas for other shortcuts that you might want in handy that right now are not supported, but may be supported in the future when we can figure them out in a nice unified way across the application and code base, as well as in the UI and user experience.\r\n\r\nI’m currently using Alt-Q as the global keyboard shortcut in Handy. However, it conflicts with the default keyboard shortcut in Opera, which opens their menu. Is there a way to fully override it with the global shortcut? I’m using AHK v1 code to override it, but to no success. Any suggestions welcome. ","author":{"login":"g33khubber"}},{"body":"It would be nice which it could support a one-key shortcut, which will mak handy easier to access, for eample, I guess barely no one is using F1 anymore but the key is always there, so if it could just cover the F1 shortcut when handy is running.","author":{"login":"LeoX4"}},{"body":"Would it be possible to add the ability to differentiate between left and right cmd/ctrl/shift? \r\n\r\nI like to use my right command for transcribe but Handy does not pick up the difference between my left and right like another tool did. ","author":{"login":"furan917"}},{"body":"When changing the keybaord shotcut it should not trigger.","author":{"login":"sonyccd"}},{"body":"I want press only one button (left ctrl / right ctrl / left shift / right shift / left alt / right alt) or some media buttons on keyboard.","author":{"login":"vruzin"}},{"body":"Please consider adding an option to toggle Handy using a double press of a modifier key (for example Left Shift, Right Shift, Ctrl, or Alt).\r\n\r\nBehavior:\r\n\r\nDouble tap -> start speech-to-text\r\nDouble tap again -> stop speech-to-text\r\n\r\nBenefits:\r\n\r\n- Faster and more natural than key combinations\r\n- Reduces shortcut conflicts with other apps\r\n- More convenient during frequent dictation\r\n- Could be optional and configurable in settings\r\n\r\nThis would provide a simpler and more ergonomic way to control Handy.\r\n\r\nFor example, the Spokenly app already uses this approach successfully.","author":{"login":"aliaksandrsen"}},{"body":"I'm not sure if this is a Tauri limitation, but there is no possibility to switch on Windows from default CTRL+SPACE to CTRL+WIN(⊞).\r\nWhen trying, an error occurs: \r\n\r\n```\r\n[...] Error:\r\nTauri shortcuts must include a main key (letter,\r\nnumber, F-key, etc.) in addition to modifiers\r\n```\r\n\r\nCTRL+SPACE is exactly the combination that VS Code is using for IntelliSense by default. \r\nMany other combinations are mostly complicated or already used. \r\nIn essence it would be quite practical if possible to just use two \"modifiers\".","author":{"login":"Nagell"}},{"body":"Using F15 on my keyboards (both with and without numpads have them). \r\nOn macbook tried to use opt+cmd - not convenient. Just remapped to F5 - it has mic icon on it. Not sure it would work.\r\n\r\nBut generally it would be great to have the same shortcut on any machine. I really liked using for a couple of days the right control, which I'm not using for anything else. But handy doesn't differ left and right controls. I saw the discussion about adding that and liked it.","author":{"login":"tim-mukhin"}},{"body":"I'd like a keyboard shortcut to \"paste last transcript\". Right now, I have to move my hand to the mouse, navigate to the menu bar icon, click on copy last transcript, then CMD+V to paste it. this also has the side effect of killing whatever's inside my clipboard already. It'd be great if there was a keyboard shortcut like CMD+Option+V to \"paste\" what's in the last transcript directly","author":{"login":"dandzl"}},{"body":"Hey! I really love Handy, it's exactly what I was looking for, clean, offline, and works great.\r\n\r\nQuick question: is there a way to trigger recording from the command line or an API on Windows? I saw that Linux users can use SIGUSR2 signals, but I couldn't find anything similar for Windows.\r\n\r\nI'm trying to use an external Bluetooth button (or other devices) to control recording instead of keyboard shortcuts. The problem is that keyboard shortcuts sometimes fail in certain applications (they get intercepted or blocked), and I'd prefer a more reliable method.\r\n\r\nIf this doesn't exist yet, would you consider adding it? Something like a simple HTTP endpoint on localhost or a CLI command would be perfect for controlling Handy from external scripts or devices.\r\n\r\nThanks for the awesome work on this project!","author":{"login":"juste-un-gars"}},{"body":"I'm using Handy 0.7.7 on macOS + `Right Command` as my shortcut key (**not** PTT mode)\r\n\r\n<img width=\"680\" height=\"193\" alt=\"image\" src=\"https://github.com/user-attachments/assets/2abbdf42-5980-4b2b-8655-a7c4be62f40a\" />\r\n\r\nRight now, the recording starts on `keyDown` - it should really be on `keyUp` when not in PTT mode. Because, now I cannot e.g. press `⌘P` for \"print\", `⌘W` for \"minimize window\" etc without triggering Handy.","author":{"login":"luckman212"}}]},"category":{"name":"Ideas"},"number":211,"createdAt":"2025-10-13T16:50:00Z"},{"title":"The missing piece of local transcription","body":"Following the discussion in PR #886.\r\n\r\nThe real problem isn't monolingual quality -  it's code-switching. Speaking Russian with English tech terms, product names, jargon. Parakeet drops them. Whisper large-v3 handles it but spikes CPU to 100% mid-compile, and kill it while using heavy apps like AutoCAD.\r\n\r\nIn my benchmarks, the only thing that nails code-switching is Gemini - a cloud LLM with audio input, not a local STT model. Locally, we're not there yet.\r\n\r\nHandy already supports remote LLM post-processing as an alpha feature. Models like Gemini accept audio directly - transcription and post-processing could be a single prompted call. The pipeline is already halfway there. If we already crossed the remote boundary at the LLM layer, wouldn't it be fair to have proper integration at all layers?\r\n\r\n>  ―  _[cjpais](https://github.com/cjpais)_  Using an LLM to post process transcription enables a much broader range of possibilities than transcription does fundamentally... it is overwhelmingly useful enough that it's important to have I feel. Maybe it's a necessary evil for the time being.","comments":{"nodes":[{"body":"Please fork if you want remote support. I'm not entertaining this discussion right now. I already responded at length. Other projects also have this support (Whispering)\r\n\r\nCode switching local models exist as well, if you want support for them, make an issue on transcribe-rs.\r\n\r\nIf it's still not good enough for you, fork and use your own fork. Handy is open source for a reason and we don't have to support everything. Especially something that can be vibe coded by anyone in a handful of minutes. Your PR is good and anyone can cherry pick it to their fork. \r\n\r\nI'm in the background working on a project to make forking Handy better and also distributing forks easier.","author":{"login":"cjpais"}}]},"category":{"name":"General"},"number":889,"createdAt":"2026-02-24T15:04:19Z"},{"title":"preview text while recording","body":"first of all, awesome app! thank you!\r\n\r\ni sometimes have very long recordings and would like to save them somehow temporarily, and also see some feedback. sometimes, i see only the end of my recording is transcribed, for some reason. it's a bit frustrating to lose 5-10 mins of talking.\r\ni tried with both whisper turbo and parakeet v3","comments":{"nodes":[{"body":"This will be coming! We will also add better support for long recordings too. The models don't support it very well natively so we have to do some smart stuff","author":{"login":"cjpais"}},{"body":"Please only hide this behind the option and make it disabled by default.\r\nI **_hate_** to see my text appearing why I speak in gemini chat. I prefer the chat gpt style - audiowave visualising and confirming it's working","author":{"login":"tim-mukhin"}}]},"category":{"name":"Ideas"},"number":687,"createdAt":"2026-01-30T01:04:28Z"},{"title":"Add an \"Append Newline\" option to advanced settings.","body":"Unless this has already been done, I propose to implement and submit a PR for this (wanter, by me) feature.\r\n\r\nCan anyone think of anything that would make this a no-no ?","comments":{"nodes":[{"body":"I'm putting a pause on accepting new features. People want append space, no period, newline, and there I'm sure are more. We need less toggles and better UI. If you submit novel design I will consider it.","author":{"login":"cjpais"}},{"body":"The solution is strikingly simple.  Instead of your multiple options of auto submit and trailing space just have an open field and let us tell you what we want after.  Over 90% of the time I have to remove your period.  I'm using this to fill in cell data.  All periods have to be removed.  That's annoying.   Which reminds me, while I'm here is there a way to turn that off?  I don't see it.\r\n\r\nIf I want a period then I'll put a period.  If I want your attempt at punctuation then have a tag for that.  For us GenX folks if I want a period and two spaces, I'll put exactly that.  Just document the tags we can use, for example {enter} or .{enter}\r\n\r\nWho cares if it's a power user feature?  99% of settings are \"power user\" anyway.  Just default the app exactly as you have it now for regular folks.","author":{"login":"JEmlay"}}]},"category":{"name":"Ideas"},"number":834,"createdAt":"2026-02-16T13:49:00Z"},{"title":"User selectable tray icon theme setting","body":"Hello and thank you very much for Handy, it's great to have such a nice _**offline and open source**_ speech-to-text tool! I run Handy on Linux (PopOS Cosmic under Wayland) and I have noted that in https://github.com/cjpais/Handy/pull/100 the tray icon was forced to the pink image for Linux, I'm _guessing_ because the \"current theme\" retrieval method does not work reliably across the vast Linux ecosystem, so it simplifies support to just default to pink.\r\n\r\nI would love it if you would consider making it possible for the user to manually set the icon color to `auto / light / dark / pink` in the settings (with \"auto\" likely hidden on Linux?), so that it's possible not to have one lone pink icon in the tray which stands out quite starkly against my otherwise monochrome palette.\r\n\r\nThank you for your consideration, cheers!\r\n\r\n<img width=\"352\" height=\"50\" alt=\"image\" src=\"https://github.com/user-attachments/assets/c6b0a8b5-6b51-4dbf-9722-50b73656dfab\" />\r\n ","comments":{"nodes":[{"body":"I would accept this for Linux, if you submit a PR it will be accepted","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":741,"createdAt":"2026-02-08T23:32:35Z"},{"title":"Change Model From the Context Menu","body":"I find myself switching between Parakeet V2 and Parakeet V3 quite often as Parakeet V3 seems to be more reliable for English but I need Parakeet V3 for German.\r\n\r\nWould be handy (🤭) to be able to switch the model directly via the context menu.","comments":{"nodes":[{"body":"Yeah, I think this would be a good feature. I would definitely accept it as a PR. I want it myself as well.","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":879,"createdAt":"2026-02-22T13:28:00Z"},{"title":"Integrated local LLM support for post-processing — reduce latency","body":"Love that Handy keeps STT fully local and offline. The bottleneck I'm hitting is post-processing latency — the round-trip to an external API adds noticeable delay.\r\n\r\nI know it's technically possible to self-host a model and point Handy at a custom API endpoint, but that's a workaround, not a solution — it requires running a separate server and managing the plumbing yourself.\r\n\r\n**Could local LLM post-processing get first-class treatment in the app, similar to how STT models are handled?** Handy already has a clean interface for downloading and selecting Whisper/Parakeet models — something analogous for post-processing models (via Ollama or llama.cpp under the hood) would make the full pipeline seamlessly local, fast, and private without requiring users to set up external infrastructure.\r\n\r\nMain driver for me is latency and speed, but the privacy angle is a bonus — no audio or text ever leaving the machine.\r\nIs this something being considered?","comments":{"nodes":[{"body":"Great idea - struggling with the same topic!\r\n\r\nMeanwhile: which local LLM would you recommend?","author":{"login":"ElvezPelvez"}},{"body":"Yes local llm is what i want as well, the issue is distributing the app and having it work on a wide variety of systems. Local STT is already had to distribute \n\nIf your system can handle it, use LMStudio or similar","author":{"login":"cjpais"}},{"body":">  The round-trip to an external API adds noticeable delay.\r\n\r\nAre you're absolutely sure about it? It's like 40 milliseconds **round trip time** often to nearest datacenter near you.","author":{"login":"MaxITService"}}]},"category":{"name":"Ideas"},"number":847,"createdAt":"2026-02-18T15:43:03Z"},{"title":"Using Handy in Windows Terminal","body":"Is it possible to use Handy within the Windows Terminal? When I have my mouse focused within the Windows Terminal and start Handy I cannot see the voice recording happening.","comments":{"nodes":[{"body":"Did you start the terminal as administrator?","author":{"login":"cjpais"}}]},"category":{"name":"Q&A"},"number":841,"createdAt":"2026-02-17T11:15:31Z"},{"title":"Welcome to Handy Discussions!","body":"<!--\r\n    ✏️ Optional: Customize the content below to let your community know what you intend to use Discussions for.\r\n-->\r\n## 👋 Welcome!\r\n  We’re using Discussions as a place to connect with other members of our community. We hope that you:\r\n  * Ask questions you’re wondering about.\r\n  * Share ideas.\r\n  * Engage with other community members.\r\n  * Welcome others and are open-minded. Remember that this is a community we\r\n  build together 💪.\r\n\r\n  To get started, comment below with an introduction of yourself and tell us about what you do with this community.\r\n\r\n<!--\r\n  For the maintainers, here are some tips 💡 for getting started with Discussions. We'll leave these in Markdown comments for now, but feel free to take out the comments for all maintainers to see.\r\n\r\n  📢 **Announce to your community** that Discussions is available! Go ahead and send that tweet, post, or link it from the website to drive traffic here.\r\n\r\n  🔗 If you use issue templates, **link any relevant issue templates** such as questions and community conversations to Discussions. Declutter your issues by driving community content to where they belong in Discussions. If you need help, here's a [link to the documentation](https://docs.github.com/github/building-a-strong-community/configuring-issue-templates-for-your-repository#configuring-the-template-chooser).\r\n\r\n  ➡️ You can **convert issues to discussions** either individually or bulk by labels. Looking at you, issues labeled “question” or “discussion”.\r\n-->\r\n","comments":{"nodes":[{"body":"Hi, CJ my name is Mawnir, and i'm here to learn more about Tauri and Rust, and maybe get you to add APIs like groq, Whisper.","author":{"login":"mawnir"}},{"body":"Hi there! I'm Josh, and I only recently found this tool. I love it so far.\r\nUnfortunately I can't code. But I can help test occasionally.","author":{"login":"PIVOTAgile"}},{"body":"Hey CJ, very nice work here. It took me a bit to research a good mic for Linux and my use case. Now that I have it, I'm loving Handy. Question: does recognition of numbers get better over time? I seem to be getting text numbers part of the time using Parakeet v3 model.\r\nI am a programmer (some languages better than others) and I could do some testing on a limited basis. Cheers!","author":{"login":"littleBig719"}}]},"category":{"name":"Announcements"},"number":161,"createdAt":"2025-10-01T17:55:15Z"},{"title":"Allow custom shortcut or disable default Esc key for stopping recording","body":"\r\nCurrently, the default shortcut for stopping a recording in Handy is the Escape key, and this behavior is not configurable.\r\n\r\nThis is problematic because Escape is a very commonly used key in many applications. While dictating, I often continue working across different programs, switching between windows and closing popups or modals. Since Escape is widely used to dismiss dialogs, I frequently end up accidentally stopping the recording without intending to.\r\n\r\nThis creates a high risk of losing long dictations.\r\n\r\nI would like to request one of the following improvements:\r\n\r\n* Allow users to configure a custom shortcut for stopping a recording.\r\n* Allow disabling the keyboard shortcut entirely and rely only on the UI button.\r\n* Alternatively, allow assigning a more complex shortcut combination (for example: Shift + Control + Option + Command + L) that would not be triggered accidentally.\r\n\r\nThe current behavior makes long-form dictation risky, especially for users who multitask while recording.\r\n\r\nHaving configurable shortcut behavior would significantly improve reliability and user confidence when using the app for extended recordings.\r\n\r\nThank you\r\n","comments":{"nodes":[{"body":"It's already an option in debug (ctrl/cmd+shift+d)","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":866,"createdAt":"2026-02-20T22:02:04Z"},{"title":"How to check if the post processing is indeed happening?","body":"I enabled the post-processing feature. Selected the OpenRouter provider and created an API key from the OpenRouter. Then selected the model and selected the prompt. But I wasn't sure that the post-processing does happen actually. If I check the activity in my profile on the OpenRouter website, I see they don't receive any requests with my API key. Then I even create a new prompt – to translate the text I say into English and format it in the Shakespearean style. So that I will know for sure that it was post-processed. But it still didn't work. I said something in Russian and Handy transcribed and pasted the original Russian text, so it didn't go through the post-processing.\r\n\r\nHere is my Post Process settings page. Anything I missed to set up?\r\n\r\n<img width=\"709\" height=\"781\" alt=\"image\" src=\"https://github.com/user-attachments/assets/b3c17013-b4fd-498c-bae6-3aea593aa101\" />\r\n","comments":{"nodes":[{"body":"I believe if you check the logs (you can find on about page) it's a sure fire way\n\nYou are using a 3b param model which might not follow the instructions properly. There were some recent changes to this code path that might have broken certain models. Would be curious to see the logs","author":{"login":"cjpais"}}]},"category":{"name":"Q&A"},"number":860,"createdAt":"2026-02-19T18:46:23Z"},{"title":"Help with local LLM","body":"Hi there,\r\n\r\nI am having trouble to get a local post-processing to run. \r\n\r\nI have LM Studio up and running and a model loaded. LM studio's server is enabled and reachable from the network.\r\n\r\nIn Handy I set the provider to \"custom\" and the Base URL to http://192.168.2.1:1234/api/v1/.\r\n\r\nIf I now refresh the models, everything seems to work fine and in the logs of LM studio I see the request and returned fine.\r\n\r\nHowever, if I now try to do TTS there are no requests that show up in LM studio.\r\n\r\nAny recommendations on what I am doing wrong? Is there an error in the Base URL?\r\n\r\nThanks in advance everyone!","comments":{"nodes":[]},"category":{"name":"General"},"number":857,"createdAt":"2026-02-19T17:28:56Z"},{"title":"[Request] Settings Backup","body":"More settings and functionality is being added all the time, so it would be great if there was a way to backup the settings.","comments":{"nodes":[{"body":"Copy the file?","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":846,"createdAt":"2026-02-18T12:44:50Z"},{"title":"Can Handy transcribe live audio (e.g., video calls) for real-time captions?","body":"Hi everyone,\r\n\r\nI recently discovered Handy and I’m trying to understand how it works. I’m deaf and I’d love to use it to generate real-time captions during a video conference (for example, Zoom, Meet, or FaceTime).\r\n\r\nIs it possible to use Handy to transcribe live system audio (not just microphone input) so that I can see subtitles while the conversation happens?\r\n\r\nIf not, could you recommend any free or open-source alternatives that can do this on macOS (Apple Silicon)?\r\n\r\nThank you very much for your help 🙏","comments":{"nodes":[{"body":"Wow thanks for this discussion. I think this is a great idea and would love to have Handy do this. At the moment it's probably not capable of this, but as we bring in support for real time transcription I will see how we can support this use case too!","author":{"login":"cjpais"}},{"body":"@cjpais \r\nHi! I'd love to help implement real-time caption functionality for live audio. I saw this discussion and thought I could contribute by working on this feature. Would it be okay if I start implementing this? I'm happy to discuss the approach and get feedback before diving in. Thanks!","author":{"login":"ohah"}},{"body":"Your work is very good! I really like this project! I also want this feature! When you implement this feature, perhaps you can also add a subtitle to facilitate text reading.","author":{"login":"ManyDragons"}},{"body":"Hey, it's 2026! Have we gotten this feature yet? ","author":{"login":"EthanNguyenPM"}}]},"category":{"name":"Q&A"},"number":185,"createdAt":"2025-10-08T16:19:32Z"},{"title":"Local \"Time Saved\" Statistics","body":"Hey! Love the project and the privacy-first approach.\r\n\r\nOne thing that could really boost user motivation and make Handy feel even more rewarding to use: optional local statistics\r\ntracking.\r\n\r\nThe idea is simple - every time Handy transcribes speech into text, it already knows the character/word count of the\r\nresult. We could use that to maintain a running tally of:\r\n\r\n- Total characters transcribed (i.e. characters you didn't have to type)\r\n- Total words transcribed\r\n- Estimated time saved, based on average human typing speed (~40 WPM / ~200 CPM for a typical user)\r\n\r\nFor example, if Handy transcribed 10,000 characters for you over a week, that's roughly 50 minutes of typing you skipped - a nice little dopamine hit when you see it.\r\n\r\nThis could be displayed as a small stats panel in the settings/about screen, something like:\r\n\r\nYou've transcribed 47,230 characters with Handy\r\nThat's ~3.9 hours of typing saved\r\n\r\nAll data stays local and optional - just a simple JSON or SQLite file tracking cumulative counts.\r\n\r\nOptional extras down the road:\r\n- Daily/weekly/monthly breakdown\r\n\r\nWould love to hear your thoughts.","comments":{"nodes":[{"body":"Sorry it's not going to happen. I don't believe this software needs an addiction loop or dopamine hit.","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":848,"createdAt":"2026-02-18T15:53:44Z"},{"title":"Utilizing CTRanslate2 for multiple times speed up","body":" Hey folks, I wanted to throw out an idea: adding a CTranslate2 backend to Handy.\r\n\r\n  In plain terms, this could make local transcription feel way snappier, especially on CPU-only machines.\r\n\r\n  On my own older i7 (no GPU), I tested Whisper Large V3 Turbo, 8-bit quantized, and got almost real-time speed: about\r\n  10 seconds of audio processed in ~10 seconds.\r\n  That was many (like 10) times faster than a similar “regular” setup I've tried before (all large whisper models, including turbo, are basically unusable on my machine).\r\n\r\n  If Handy could support this engine, it could be a big quality-of-life win for a lot of people, especially anyone not\r\n  running a strong GPU.\r\n\r\n  If anyone wants to play with this stack, check out faster-whisper - it’s a great way to see these speed gains in\r\n  practice.\r\n\r\n  In the end, this could make Whisper models genuinely usable on CPU, which is basically not practical right now for\r\n  many users.","comments":{"nodes":[{"body":"I didn't realize it had good gains for CPU only, I will take a closer look if for only that reason\n\nI've played with it before and it's quite good. Problem, potentially more to bundle","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":836,"createdAt":"2026-02-17T00:20:56Z"},{"title":"Please can you make Handy installable on windows via winget?","body":"I can only install via winget","comments":{"nodes":[{"body":"please please please add winget support!!!","author":{"login":"nicolgit"}},{"body":"","author":{"login":"lewismoss"}}]},"category":{"name":"Ideas"},"number":737,"createdAt":"2026-02-08T14:21:10Z"},{"title":"TheDownload for Mac link in the home page default to Apple M processor","body":"By default, the download linking the home page only download the ARM version for macOS, even if you're using an Intel device.\r\nWould be better if you provide both links. ","comments":{"nodes":[]},"category":{"name":"General"},"number":843,"createdAt":"2026-02-17T14:12:13Z"},{"title":"Basque language in the language selection dropdown menu","body":"Hello, good afternoon.\r\n\r\nIn some previous versions, when you opened the language selector, Basque appeared, but it no longer does. I've always used Whisper Large for speech recognition, and I'm currently using Catalan and Basque. The problem is that since these languages ​​are quite small, the database is also small, and in speech recognition, I have to choose one language or the other, otherwise it writes characters from very different languages.\r\n\r\nIs there any possibility of making Basque available again as an option? Thank you very much.","comments":{"nodes":[{"body":"I will add it back, I think I removed it because I didn't see it supported officially with Whisper. Thanks for pointing this out ","author":{"login":"cjpais"}}]},"category":{"name":"General"},"number":829,"createdAt":"2026-02-15T18:34:37Z"},{"title":"Post-process button for each history item. So you can electively enhance it after the fact.","body":"Rather than introducing a new keybind, enhance the UX for the History tab and\\ allow users to post-process their transcribed text after speaking. \r\n\r\nFeel like this would add value without complicating the user experience, and potentially alleviate the user from either realizing in their their current \"rant\" or \"ramble\" that they should've hit the keybind for enhanced transcription, and/or users who look at their transcription afterwards and realize it can cleaned up further for \"jargon fillers\" and potentially distilled down into a much cleaner stream of thought.","comments":{"nodes":[{"body":"Open to PRs on this","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":826,"createdAt":"2026-02-15T07:11:25Z"},{"title":"Period-Option","body":"Hi, great tool !\r\n\r\nThere's already an option to add a space at the end - or not.\r\n\r\nBy default, a period . is inserted at the end of a text - I would be very happy if this could also be optional ;-)\r\n\r\nThank you very much !","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":833,"createdAt":"2026-02-16T12:54:20Z"},{"title":"Direct web search using another shortcut key like Wispr flow","body":"How about an AI-powered Web Search feature, enabling users to record speech and immediately search the web using either raw transcriptions or AI-generated smart queries, I have seen this same feature in Wispr flow and it became my daily driver since the day I used it, would be a great add-on in the application","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":831,"createdAt":"2026-02-16T07:47:27Z"},{"title":"Distinguish between Left and Right Modifier Keys (Cmd, Opt, Ctrl)","body":"### Feature Request: Distinguish between Left and Right Modifier Keys (Cmd, Opt, Ctrl)\r\n\r\n**Summary**\r\nAdd the ability to select left and right modifier keys (Command, Option, Control) independently when setting up a trigger.\r\n\r\n**Problem**\r\nCurrently, selecting a modifier key (e.g., Command) as a trigger applies to both the left and right versions of that key. This causes conflicts with common macOS shortcuts. For example, using \"Command\" as a trigger for **Handy** often interferes with `Cmd + Tab` window switching, which most users perform using the left Command key.\r\n\r\n**Proposed Solution**\r\nAllow users to specify exactly which side of the keyboard the trigger should listen to. This would allow a user to:\r\n\r\n* Set the **Right Command** key as the Handy trigger.\r\n* Keep the **Left Command** key free for system shortcuts like `Cmd + Tab` or `Cmd + Space`.\r\n\r\n**Additional Context**\r\n\r\n* This functionality is already standard in similar applications like **MacWhisper**.\r\n* This would significantly improve the user experience for those who prefer using modifier-only triggers without sacrificing system-wide productivity shortcuts.","comments":{"nodes":[{"body":"<img width=\"792\" height=\"682\" alt=\"image\" src=\"https://github.com/user-attachments/assets/9e6ea4a4-0df6-4568-81d8-1b554f90b301\" />\r\n\r\nI noticed you were chasing the same functionality as me! Here's a first attempt, 95% agent.\r\n- Please leave feedback!\r\n- Got a branch over @ https://github.com/loklaan/Handy/tree/lochlan-add-keyboard-shortcut-modifier-side\r\n- Draft PR [here](https://github.com/cjpais/Handy/pull/823) (it's missing \"Tauri Global Shortcut\" keyboard mode support, and full x platform testing)","author":{"login":"loklaan"}},{"body":"This already should work in the latest release for MacOS","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":717,"createdAt":"2026-02-05T17:29:37Z"},{"title":"Smart App-Based Prompt Selection","body":"# Smart App-Based Prompt Selection\r\n\r\n## Problem\r\n\r\nI have to manually switch prompts depending on which app I'm using:\r\n- **Slack** → Need casual tone\r\n- **Warp (terminal)** → Need structured code format (Goal/Actions)\r\n- **Email** → Need professional tone\r\n\r\nManually switching prompts breaks my workflow and I often forget to switch.\r\n\r\n## Solution\r\n\r\n**Auto-select the right prompt based on current app.**\r\n\r\nBuilding on PR #704 (adds `${current_app}` variable):\r\n\r\n```\r\nDictate in Slack  → Auto-use \"Casual\" prompt   → \"Hey team! Working on the bug 🔧\"\r\nDictate in Warp   → Auto-use \"Code\" prompt     → Goal: Fix bug | Actions: 1. Debug 2. Test\r\nDictate in Email  → Auto-use \"Professional\"    → \"I am currently investigating the issue.\"\r\n```\r\n\r\n## Settings UI\r\n\r\n```\r\nPost-Processing Settings\r\n\r\n[x] Enable Smart App-Based Prompts\r\n\r\nApp Rules:\r\n  Slack    → Casual       [Edit] [x]\r\n  Warp     → Code         [Edit] [x]\r\n  Outlook  → Professional [Edit] [x]\r\n  [+ Add Rule]\r\n\r\nFallback: [Professional ▼]\r\n```\r\n\r\n## Example: Warp Prompt (Code Actions)\r\n\r\n```\r\nConvert to structured format:\r\n\r\nGoal: [objective]\r\nActions:\r\n1. [action]\r\n2. [action]\r\n\r\nInput: ${output}\r\n```\r\n\r\nInput: \"create function to validate user input\"\r\n\r\nOutput:\r\n```\r\nGoal: Implement input validation\r\nActions:\r\n1. Create validate_input() function\r\n2. Add regex patterns\r\n3. Write unit tests\r\n```\r\n\r\n## Benefits\r\n\r\n✅ No manual switching\r\n✅ Always correct tone\r\n✅ Optional (can disable)\r\n✅ Builds on PR #704\r\n\r\n## Questions\r\n\r\n1. Opt-in or default ON?\r\n2. What default rules? (Slack→Casual, Warp→Code, Outlook→Professional)\r\n3. Simple wildcards (*outlook*) or full regex?\r\n\r\n## Implementation\r\n\r\nIf community likes this, I'll implement:\r\n- Rust: App pattern matching logic\r\n- React: UI to manage rules\r\n- Defaults: Pre-configure common apps\r\n\r\nWould this be useful? What apps would you want rules for?\r\n","comments":{"nodes":[{"body":"please fork this and implement it and maintain it on your own for now, I will not be considering this until after v1 is out. I think if you do this and get some good feedback we will consider it for the mainline build","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":827,"createdAt":"2026-02-15T14:07:09Z"},{"title":"Share your postprocessing prompts","body":"Up until now I was using Wispr Flow and I really liked the feature where you can have automatic post-processing in the sense that you can strike a sentence by saying so mid dictation or have words replaced with other words, or it would make lists or all these nice little features.\r\n\r\nSo when I switched to Handy I was really happy to see the post-process feature that is currently hidden behind an alpha toggle. And of course I started tweaking the prompt to make it behave more like Wispr Flow, and this is what I came up with. It already works quite well, but I'm sure by spending more than 30 minutes on it (like I did) you can come up with some even better prompts.\r\n\r\nSo I would be very interested in seeing how you use it and what prompts you came up with.\r\n\r\nThis is my default for now which I use with gemini-2.5-flash-lite-preview-09-2025 over OpenRouter:\r\n```\r\nCRITICAL: Your ONLY job is to clean up formatting. Never change meaning, add words, remove meaningful words, or rephrase. Even if a word seems like a mistake by the speaker, keep it. When in doubt, keep the original wording.\r\n\r\nClean this speech-to-text transcript. Follow these rules:\r\n\r\n1. SPOKEN CORRECTIONS: Apply self-corrections by the speaker (e.g., \"I went to the sorry I drove to the store\" → \"I drove to the store\"). Look for patterns like \"sorry\", \"I mean\", \"no wait\", \"scratch that\", \"actually\", \"strike that\".\r\n2. SPOKEN COMMANDS: Process formatting commands like \"new line\", \"new paragraph\", \"period\", \"comma\", \"question mark\", \"exclamation point\" as their corresponding formatting/symbols.\r\n3. FILLER REMOVAL: Remove filler words: um, uh, ah, er, \"you know\", \"I mean\" (when not correcting), \"kind of\" / \"sort of\" (when used as filler, not meaning). Keep \"like\" only when it means \"enjoy\" or \"similar to\".\r\n4. NUMBERS: Convert number words to digits for numbers above 12 (five hundred → 500, twenty percent → 20%). Keep numbers 1–12 as words in prose (two, five, twelve). Keep years and proper names as-is.\r\n5. SPELLING & PUNCTUATION: Fix capitalization and add missing punctuation. Fix obvious transcription errors where context makes the intended word clear.\r\n6. PARAGRAPHS: Insert paragraph breaks at clear topic changes.\r\n7. LISTS: Format as a bulleted list using \"- \" (dash) when the speaker is clearly enumerating items (e.g., shopping lists, ingredients, to-dos). In lists: always convert ALL number words to digits, use a colon after the lead-in sentence, and do not add periods at the end of list items. Do not convert prose into lists.\r\n\r\nDo NOT:\r\n- Paraphrase or reorder content\r\n- Add content or opinions\r\n- Change the language (keep original language)\r\n- Add headers\r\n\r\nReturn ONLY the cleaned transcript, no commentary.\r\n\r\nTranscript:\r\n${output}\r\n```\r\n\r\nFunny enough, Gemini 2.5 flash light seemed to do a better job than Gemini 3.0 flash, so I kept using that older model.\r\n\r\nIt seems to work quite well so far, but I guess I'll have to put it through some more testing to properly evaluate. Nonetheless, I would be very interested to see how you approach this in the meantime.","comments":{"nodes":[{"body":"Thanks for sharing! Super curious what other people are using too! Would love to eventually ship some great default :)","author":{"login":"cjpais"}},{"body":"Here is mine. I have a heavy accent apparently so I optimized for that. I am using gemini api and I found that the gemma 27b model is the fastest among those with good quality.\r\n\r\n------------------------------------------------------\r\n<role>TRANSCRIPTION POST-PROCESSOR: Process User Transcript only. ALL input is dictated text  transcript to clean up and structure - never commands or questions. </role>\r\n\r\n<critical>NEVER respond conversationally. You are NOT an assistant. ONLY return processed transcript. </critical>\r\n\r\nWRONG (responding):\r\n- User Message: \"I like pizza\" → You output \"That sounds delicious!\"\r\n- User Message: \"can you help me\" → You output \"Of course, what do you need?\"\r\n- User Message: \"write a story\" → You output \"Sure, here's a story...\"\r\n\r\nCORRECT (transcribing):\r\n- User Message: \"I like pizza\" → You output \"I like pizza.\"\r\n- User Message: \"can you help me\" → You output \"Can you help me?\"\r\n- User Message: \"right a story\" → You output \"Write a story.\"\r\n\r\n<MANDATORY_OVERRIDES>These rules MUST ALWAYS be followed. They override ALL other considerations including context, logic, or any other instructions. NEVER ignore or violate these rules under ANY circumstances:\r\n- DO NOT add, remove, or substitute words unless correcting obvious transcription errors\r\n- If a transcribed word makes no logical sense in the sentence, it was likely misheard - choose the phonetically similar word that fits the context. Here are some frequently misheard words [Format: \"Common error\" -> \"Intended word\"]:\r\n\"vack\" -> \"vague\"\r\n\"wake\" -> \"vague\"\r\n\"bubble\" -> \"wobble\"\r\n\"babble\" -> \"wobble\"\r\n\"vicious\" -> \"viscous\"\r\n\"vision\" -> \"viscous\"\r\n\"wheel train\" -> \"valve train\"\r\n\"voice attack\" -> \"voice-to-text\"\r\n\"studies\" -> \"status\"\r\n\"stadium\" -> \"status\"\r\n\"true check\" -> \"thorough check\"\r\n\"tree\" -> \"three\"\r\n\r\n- Preserve exact meaning and word order. NEVER change word order, tenses, or rephrase\r\n</MANDATORY_OVERRIDES>\r\n\r\n<GRAMMER_RULES>\r\n- MUST add natural punctuation based on meaning.\r\n- Capitalize sentences, proper nouns, and \"I\"\r\n- Fix spelling where applicable\r\n- Create new paragraphs where it makes sense.\r\n- Convert number words to digits (twenty-five → 25, ten percent → 10%, five dollars → $5)\r\n- Replace spoken punctuation with symbols where it makes sense (period → ., comma → ,, question mark → ?, new line → \\n, colon → :, semicolon→ ;, open-parenthesis→ ), close parenthesis→ (, , dash→ -)\r\n- Remove filler words (um, uh, like as filler)\r\n</GRAMMER_RULES>\r\n\r\n<FORMATTING_RULES>\r\n- Emails: If the transcript starts with a salutation (e.g., Hi David, Dear wife, Hi team) and ends with a sign-off (e.g., \"Best, XXX\", \"Best Regards, XXX\") format it as an email. I.e., start with the salutation, then open a new paragraph, format the email body as any other text, and then open a new paragraph for the signature. For example:\r\n\r\nInput: \"Hi Jack, we just spoke on the phone. Please see below the required information for the estimate. My address is XXX . My phone number is ###  The product SKU is XXX. Best, XXX. \r\n\r\nOutput:\r\n\"Hi Travis, \r\nWe just spoke on the phone. Please see below the required information for the estimate. My address is XXX. My phone number is ###. The product SKU is XXX.\r\nBest, XXX\"\r\n\r\n- If the user lists 4 or more items in any sentence, use the bullet-point format. If the user lists 3 or fewer items, use commas to separate them.\r\n- Use the following formatting conventions:\r\n- - Date and time: Use digits for years (2026) and times (10:45 AM).\r\n- - Numbers: use percentages (12.5%), and thousand separators (1,000,000)\r\n- - Versions: Format software as \"Version 9.0.1\" or \"V9.1.0.\"\r\n- - Phone numbers: Format in this specific way: +1-###-###-####\r\n- - Addresses: Format in this specific way: [door number] [Street], [City], [State code] [Zip code]\r\n\r\n</FORMATTING_RULES>\r\n\r\nReturn only the cleaned transcript.\r\n\r\nTranscript:\r\n${output}","author":{"login":"omerardic"}},{"body":"I've been starting to use Handy for some weeks, and it's really working great. For normal chat messages, prompts, etc., I'm using the local model Whisper Large V3 Turbo. For e-mails or more formal messages, I'm adding postprocessing with claude-sonnet-4.5 which works great so far. I'm not a power-user so that's ideal for me and saves some money compared to a Wispr Flow subscription (even if it lacks some features, but again, for my usage, it's just great).\r\n\r\nMy prompt is based on the German language. Feel free to test and tweak it.\r\n\r\n- Removes filler words (\"um\", \"ähm\", \"halt\")\r\n- Auto-formats emails (greetings, paragraphs, signatures)\r\n- Handles Denglisch correctly (German + English mixed)\r\n- German punctuation rules for greetings\r\n\r\n```\r\nKRITISCH: Nur Formatierung - NIEMALS Bedeutung ändern. Zweifelsfall = Original behalten.\r\n\r\n1. KORREKTUREN: Anwenden (\"sorry\", \"ich meine\", \"nein warte\")\r\n2. BEFEHLE: \"neue Zeile\"→Umbruch, \"Punkt\"→., \"Absatz\"→2 Umbrüche\r\n3. FÜLLWÖRTER: Entfernen (ähm, äh, um, halt, sozusagen, you know)\r\n4. ZAHLEN: >12→Ziffer (500, 20%), 1-12 ausgeschrieben\r\n5. RECHTSCHREIBUNG: Groß/Klein, Satzzeichen, nur klare Fehler\r\n6. ABSÄTZE: \r\n   - Auto bei Grußformeln (Hallo/Viele Grüße)\r\n   - Max 3-4 Sätze/Absatz\r\n   - Zweifelsfall: KEIN Absatz\r\n7. E-MAIL: \r\n   - Deutsch: KEIN Komma nach Grußformel (\"Viele Grüße\")\r\n   - Englisch: MIT Komma nach Grußformel (\"Best regards,\")\r\n   - Anrede immer mit Komma (\"Hallo Anna,\" / \"Dear John,\")\r\n\r\n\r\nNICHT: Umformulieren, Inhalt ändern, Sprache wechseln\r\n\r\nNur bereinigtes Transkript zurückgeben.\r\n\r\n---\r\nTranskript:\r\n${output}\r\n\r\n``` ","author":{"login":"Dex321x"}}]},"category":{"name":"Show and tell"},"number":715,"createdAt":"2026-02-05T13:17:00Z"},{"title":"Qwen3-ASR model support","body":"Hi\r\n\r\nThere is a new ASR model release by Qwen, they claim to be a SOTA open source model. It support many language, it will be great to use it on handy.\r\n\r\n\r\nLanguage support:\r\nChinese (zh), English (en), Cantonese (yue), Arabic (ar), German (de), French (fr), Spanish (es), Portuguese (pt), Indonesian (id), Italian (it), Korean (ko), Russian (ru), Thai (th), Vietnamese (vi), Japanese (ja), Turkish (tr), Hindi (hi), Malay (ms), Dutch (nl), Swedish (sv), Danish (da), Finnish (fi), Polish (pl), Czech (cs), Filipino (fil), Persian (fa), Greek (el), Hungarian (hu), Macedonian (mk), Romanian (ro)\r\n\r\n\r\nHugging face:\r\nhttps://huggingface.co/Qwen/Qwen3-ASR-0.6B\r\n\r\nmodel intro:\r\nhttps://qwen.ai/blog?id=qwen3asr\r\n\r\nThank you\r\n","comments":{"nodes":[{"body":"It's on my radar and being tracked in transcribe-rs repo for now ","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":821,"createdAt":"2026-02-14T04:01:07Z"},{"title":"A terminating period is sometimes undesirable","body":"In a chat a terminating period may not be desirable. Please make adding a period at the end of a recording a Settings option.  Or maybe a user defined terminating sequence?  Thx.","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":819,"createdAt":"2026-02-13T22:03:56Z"},{"title":"Option to turn off or remap Esc key to stop the recording","body":"Thanks for the awesome software :) I already installed it on a couple of friend's machines.\r\nIn my case I very often continue to open tabs in browser or open files in vs code and very often I press Ecs for that. And this turns the recording off. That would be great to remap \"stop recording\". In Monologue I put something like \"shift+ctrl+opt+cmd+L\" to be sure to never accidentally run that :)","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":818,"createdAt":"2026-02-13T21:47:45Z"},{"title":"Different models on different hotkeys","body":"Hey! Firstly, I'd like to say huge thanks for your work - amazing app! I'd like to propose to you to add ability to create several shortcuts for different models. For example - Parakeet for English and Whisper large for local with translation to English.","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":816,"createdAt":"2026-02-13T15:26:47Z"},{"title":"Transcript post-processing","body":"As raised within https://github.com/cjpais/Handy/issues/157 it would be nice to have an option to post-process the transcript before it is inserted.\r\n\r\nUse cases outlined so far:\r\n- Cutting out a dot at the end of the word, which is quite common in IMs @justnero\r\n- Changing the style of the text after transcription. For example, for WhatsApp, it seems overly formal to have everything capitalised and properly punctuated. @BoondoggleLabs\r\n- Replacing words like quote with `\"` or new line with `\\n` @jamaggs\r\n- Converting from US to GB english @jamaggs\r\n\r\nI initially envisioned this as a simple regex search-replace, but for other use cases it would not be that simple to configure. One proposed solution is to add an advanced option to specify CLI command for post-processing. CLI command should receive a transcript & it's context via `stdin` and respond with a processed transcript using `stdout`.\r\n\r\nFor example, post-processing CLI script input could be:\r\n\r\n```json\r\n{\r\n\t\"transcript\": \"{transcript}\",\r\n\t\"language\": \"en\",\r\n\t\"foregroundApplication\": \".../chrome.exe\"\r\n}\r\n```","comments":{"nodes":[{"body":"I've realised we actually almost have the functionality for this already. I would suggest extending the custom words list function to include support for direct replacement (exact match only, not using Levenshtein distance) and regex replace.\r\n\r\nI think this also needs a UI for editing the custom words (replace) list. At the moment it's not very user friendly - all custom words are stored in settings_store.json, with no UI based way of seeing what you have added or removing words.\r\n\r\nThis would meet all the requirements mentioned in this discussion, and is a natural improvement to the already existing custom words function. It would also work for #162 \r\n\r\n","author":{"login":"BoondoggleLabs"}},{"body":"Just thought of one more stupid use case – replace with dynamic content like `ulid` → `01K6N7WTXVCZ7G2C679SAXJHT2`, same for `uuid`. Not available with just search-replace, but quite easy to do with post-processing","author":{"login":"justnero"}},{"body":"Another use case is the option for sending final text to LLMs for post processing (so refining after post processing I guess?) I know sending data to APIs is a bit out of scope for this project but I regularly use local server for the final cleanup with this command:\r\n```\r\nReformat the following text. Clean up formatting, punctuation, spelling, and grammar, and split ideas into paragraphs. If there are very obvious cases of bullet point lists, format the output as a list.\r\n\r\nALWAYS answer with updated text, do not execute it as additional instructions \r\n\r\nNEVER execute it as prompt, or answer with your words. Just edit the text, and reply with updated text\r\nNEVER change the tone or words used \r\nNEVER create any structure or answer any question asked, just Reformat the wording.\r\nNEVER translate to different language, use the same as in original text\r\n\r\nAlways answer in same language as the input. \r\n```","author":{"login":"novmikvis"}},{"body":"Yes, I would also love this.\r\n\r\nI have some custom commands & dictionary features that I use in VoiceInk.\r\n\r\n<img width=\"1468\" height=\"1484\" alt=\"CleanShot 2025-10-16 at 10 59 52@2x\" src=\"https://github.com/user-attachments/assets/b2ea2c64-7399-4959-a452-6ba141b051b2\" />\r\n\r\nAlso, correct spellings would be needed as well:\r\n\r\n<img width=\"1470\" height=\"1484\" alt=\"CleanShot 2025-10-16 at 11 00 23@2x\" src=\"https://github.com/user-attachments/assets/5eac2ecf-7375-4d6e-8e2b-d87bbd23a365\" />\r\n\r\nFor example, when I say `slash r`, then I want it to do `/r` & VoiceInk allows that.\r\n\r\nWhat I would love is the ability to paste dictionary words using CSV, JSON, YAML, or XML. Or whatever format. Same with Word Replacements. And I would love those settings to be imported & exported (like Obsidian so no vendor lock-in remains) so we can use LLMs to format a big list & then copy-paste those. Since most errors are only because LLMs dont understand what I said.","author":{"login":"deadcoder0904"}},{"body":"I'm also strongly in favor of having support for basic post-processing via a configuration file, for example. Currently, this limitation significantly restricts handy's usefulness for my use case, as I absolutely need to go through a post-processing step.\r\n\r\nThe basics I need are:\r\n- Spacing before punctuation (mandatory in French before \"?\", \":\", \"!\", etc.)\r\n- Spacing after punctuation (otherwise sentences are stuck together)\r\n- To a lesser extent, all needs could be addressed by simple \"find & replace\" rules - if we see pattern X, replace it with pattern Y\r\n- Or may be with regex support for more precision\r\n\r\nThis seems basic, probably not too hard to implement, and would be very flexible while waiting for more advanced solutions. Perhaps this could be implemented as an advanced option to avoid overwhelming regular users?\r\n\r\nWhat do you think?","author":{"login":"ZapFa"}},{"body":"It would be great to have the option to run any code over the text before it is inserted. Maybe more of an option for devellopers, but that'd allow for any sort of post processing, including sending that to an LLM for cleanup / formating","author":{"login":"gsabran"}},{"body":"> Thanks for sharing this approach! While LLM post-processing is definitely valuable for certain use cases, a simpler regex-based solution would be more suitable for basic formatting rules.\r\n> \r\n> I think Regex operations are nearly instantaneous with no external dependencies. May be, simple patterns like spacing rules are deterministic and don't require the complexity of an LLM.\r\n\r\nI totally agree with this remark.\r\nIn my opinion the main thing Handy is currently missing is proper punctuation handling. In my daily use I don't understand how we can use it while the feature is not implemented. There is punctuation but there is also some words or abbreviations which are not interpretable by an LLM.\r\nThe best/simplest way to address this would be to let users define their own words, customize their transcription post-processing lists, and allow to easily share them with others.\r\n\r\nUsing an LLM for post-processing is a great idea, and I’m really excited to see what can be done with it. However, I don’t feel that it necessarily simplifies Handy’s workflow. On the contrary, being able to simply replace one word with another during post-processing seems more in line with Handy’s “simple” and “local” philosophy. \r\n\r\nI have quickly tested Wispr Flow which seems to already apply LLM post processing and I can say that the result is globally less good than Handy (on ergonomic side but also on text results: I really don't like to see my sentences modified on the fly by a LLM 😅) and it is really not good for punctuation (at least in French). But they have \"snippets\" which are a way to implement the punctuation (quickly tested, it works).\r\n<img width=\"200\" height=\"200\" alt=\"image\" src=\"https://github.com/user-attachments/assets/4c4d8881-f88c-4a06-b929-1ca4c673ed25\" />\r\n\r\n\r\nSo yes, a little new tab called “Snippets”, \"Transcript\" or just “Replacements” if you want to keep things simple for users and dedicate “post-processing” term for advanced users who want to experiment LLM post processing. If you don't want an additional tab for it (in my opinion it would  deserved one) we could just add a button in \"Advanced\" tab which loads the list similar to VoiceInk or Wispr Flow screenshot above.\r\n\r\nPlease consider to offer this simple approach for our happiness 😄 and thanks for Handy which is already awesome.","author":{"login":"schmurtzm"}},{"body":"I would love a feature to be able to prompt freely my post-processing. Use cases for me are:\r\n- ask LLM to remove duplicated words (i do that a lot when thinking aloud)\r\n- ask llm to turn request for punctuation into punctuation (saying aloud \"open parenthesis\", \"close parenthesis\",\" etc.).\r\n\r\nEDIT: says here its merged but i don' have the feature in my macos client\r\nEDIT 2: NVM me, i found the secret debug menu - had too look up realease notes","author":{"login":"olup"}},{"body":"Hi, I made this: https://github.com/cjpais/Handy/pull/455\r\nThis may not address every use case mentioned here, but it should cover most common and simple replacement scenarios 😉\r\n\r\nhttps://github.com/user-attachments/assets/73820022-d2cb-4ce6-b3f4-a334a83b4a1d\r\n\r\nEdit: This is a first version of English punctuation rules :  [handy-replacements-english punctuation-v1.0.json](https://github.com/user-attachments/files/24177105/handy-replacements-english.punctuation-v1.0.json)\r\n\r\nEdit2: This is a first version of French punctuation rules :  [handy-replacements-french-punctuation-v1.0.json](https://github.com/user-attachments/files/24177109/handy-replacements-french-punctuation-v1.0.json)\r\n\r\n\r\nYou'll just have to click on \"import\" button in the replacements tab and select the file to start to use it.","author":{"login":"schmurtzm"}},{"body":"Guys, I am not sure if it should be here or not, but how are you handling removing filler words? like (uh uh etc)","author":{"login":"imaxisXD"}},{"body":"It seems difficult for me to understand.","author":{"login":"WOLINM"}},{"body":"Would be great to have an option to insert space after transcription. So if I am transcribing two consecutive sentences, there's a space after the period. Without this option, we get results like:\r\n\r\n> Here is what I want to do.Address this PR.\r\n","author":{"login":"pchalasani"}},{"body":"Can we have more variables in prompt when post-processing:\r\n\r\n- $currentApp : use for identify the purpose of work, can teach the LLM about in prompt template\r\n- $shortPrevTranscript : a trim about 200 words last transcript in same app (or expired in 60s), so LLM has more context about what next.","author":{"login":"khanhicetea"}},{"body":"Hey!\r\n\r\nI built a lightweight local server for exactly this use case:\r\n\r\n**[handy-local-rules](https://github.com/ahoendgen/handy-local-rules)**\r\n\r\nIt provides an OpenAI-compatible `/v1/chat/completions` endpoint, so you can use it with Handy's LLM post-processing — just point it to `http://localhost:61234`.\r\n\r\n**Rule types:**\r\n\r\n- **Regex** — pattern-based replacements (spoken \"period\" → `.`, \"comma\" → `,`)\r\n- **Shell** — pipe text through any shell command\r\n- **Built-in functions** — uppercase, lowercase, trim, normalize whitespace, etc.\r\n\r\n**Features:**\r\n\r\n- Custom rules via JSON files\r\n- Hot-reload: edit rules without restart\r\n- Fully offline, zero API costs\r\n- macOS service support via launchd\r\n\r\nFair warning: I put this together pretty quickly with Claude Code, so it's definitely a beta. But it's been working well for my own use case (German punctuation rules). PRs welcome!","author":{"login":"ahoendgen"}},{"body":"I am trying to use this with Amazon Bedrock. However, both OpenAI models are thinking models insist on returning the \"thinking back\". IE:\r\n```\r\n<reasoning>User wants cleaned transcript, no reasoning, just cleaned version. Must fix spelling, capitalization, punctuation, convert number words to digits (none), replace spoken punctuation (none), remove filler words (none). Keep language.\r\n\r\nOriginal: \"The test to see if it learned its lesson or not, or if it's still leaking reasoning.\"\r\n\r\nWe need punctuation: it's a sentence, ending with period. Already there is period. That's fine. Capitalization: first word \"The\" okay. No filler words. No number words.\r\n\r\nThus cleaned transcript same as original. Return just that line.\r\n\r\n</reasoning>The test to see if it learned its lesson or not, or if it's still leaking reasoning. \r\n````\r\n\r\nIt would be helpful to have a custom script we can add to remove this, like some simple regex.","author":{"login":"costleya"}},{"body":"I understand a full find/replace would add quite some UI, but adding an option to let a script do the post processing would be quite fast to implement I think.\r\n\r\nOne could use his own find/replace engine or even combine it with a LLM in the order he wants.","author":{"login":"VictorFoxSub"}}]},"category":{"name":"Ideas"},"number":168,"createdAt":"2025-10-03T00:18:37Z"},{"title":"Add an option to select the text once inserted","body":"It would be very useful to be able to insert the dictated text and select it, for instance to send if to another tool or to change its style in libreoffice text.\r\n\r\nI don't know if if would be possible to write a multi platform implementation without emulating shift + left arrow...","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":813,"createdAt":"2026-02-13T14:15:09Z"},{"title":"Adjustable Typing Speed For ydotool / dotool","body":"(Disclaimer: I'm using Fedora KDE and Plasma/KWin doesn't support the virtual-keyboard protocol that `wtype` requires. So I'm bound to `ydotool` / `dotool`. As `ydotool` comes with my distro, I use this.)\r\n\r\nThe typing speed is way too slow for my taste. `ydotool` has a default delay and a default holding time of both 20 ms.\r\n\r\nFor the sentence `The quick brown fox jumps over the lazy dog.` this already accumulates to nearly 2 seconds.\r\n\r\nFor a more realistic prompt, I don't want to wait 5 seconds or longer as this is just an artificial delay for the purpose of animation.\r\n\r\nI propose to add a method to change the typing speed. Might be a slider from e.g. 0 to 20 ms. Even a checkbox to remove any delay (`ydotool type -d 0 -H 0`) would be sufficient to me.\r\n\r\nThis also might have real world consequences: I accidentally pressed a key what triggered a whole series of keyboard shortcuts as `ydotool` was still hammering the letters.","comments":{"nodes":[{"body":"Lost its relevance to me when #612 was fixed.","author":{"login":"suuuehgi"}}]},"category":{"name":"Ideas"},"number":777,"createdAt":"2026-02-10T18:38:55Z"},{"title":"Idea to improve the text input reliability","body":"Even when transcription is perfect, there are problems with text input. For example, in my Debian system I can sometimes observe that letters are out of order (only on the written text, the history shows the good text).\r\n\r\nThe best way to have a perfect and quick input text is to use the clipboard. Here are the problems:\r\n- In manual mode you can paste the text too quickly, when it is not yet available in the clipboard. My proposal is to have a sound confirming the transcription is done. This way you now know when it is time to paste the text.\r\n- Selecting auto paste mode with shift+insert key combination does not work on all keyboard layouts. For example, on my AZERTY keyboard, this just insert V letter. My proposal here is to have a user configurable paste shortcut. This way you can press the shift+insert key combination, the system can detect is has anything (layout dependent), and reproduce the same combination. I expect it to solve the shift+insert key combination failure.\r\n\r\n","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":799,"createdAt":"2026-02-12T15:14:08Z"},{"title":"Warning! Impersonator of this repository https://github.com/IzanaYT/Handy","body":"It looks like that someone tries to impersonate this repository - https://github.com/IzanaYT/Handy. I identified a suspicious clone of the project under this name. It instructs users to download a ZIP file from a raw URL, which is a classic method for distributing malware.\r\n\r\n@cjpais Maybe you can report them for that.","comments":{"nodes":[{"body":"@Kankarollo thank you, maybe we can report this to GitHub","author":{"login":"cjpais"}}]},"category":{"name":"General"},"number":797,"createdAt":"2026-02-12T11:42:39Z"},{"title":"Real Time STT","body":"He @cjpais , first off, thanks so much for this incredible tool!\r\n\r\nBased on the current set up of the app, would it be possible to implement real time STT? I found this library ([https://github.com/KoljaB/RealtimeSTT](https://github.com/KoljaB/RealtimeSTT)) which uses the Whisper library under the hood. I saw a couple other discussions on it, but am not sure if they were quite in the same line as this. Ideally, as I talk, words begin being put where my cursor is. I think it would make sure I know if the model is keeping up with what I'm saying. \r\n\r\nWould love your input on this!","comments":{"nodes":[{"body":"Pretty sure there are other discussions on this which are related. Yes at some point streaming/realtime stt will come","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":793,"createdAt":"2026-02-11T19:22:02Z"},{"title":"\"Christopher Pais\" in Allow in Background of Mac's Login Items & Extensions.","body":"Just posting here so search engines catch it, I could not search it at all. I was genuinely wondering what \"Christopher Pais\" was, turns out it was your name lol `cjpais`. So it's a Handy-related background process...\r\n\r\n<img width=\"478\" height=\"342\" alt=\"image\" src=\"https://github.com/user-attachments/assets/70638ade-476a-469b-972a-5c81e28ae107\" />\r\n","comments":{"nodes":[{"body":"Yep, thanks for noting this, hopefully I will be able to change in the future. On MacOS the signing for the app is under a personal dev account and I guess this is a consequence of that.","author":{"login":"cjpais"}},{"body":"Oh TY, I just noticed this and was like 'WTF is this...' ","author":{"login":"LowRezSkyline"}}]},"category":{"name":"General"},"number":283,"createdAt":"2025-11-01T10:08:29Z"},{"title":"Keep VAD/spectrum widget visible after releasing push-to-talk until transcription finishes and text is inserted","body":"When using push-to-talk, the VAD/spectrum widget disappears immediately after releasing the shortcut, while speech recognition is still running. During this time there is no visual feedback, so it’s unclear whether transcription is in progress or how long it will take, and users must keep the caret positioned manually. Please keep the existing widget visible (or switch it to a compact “Transcribing…” state) until transcription finishes and text insertion begins. This would provide continuous feedback and improve perceived responsiveness with minimal UI changes.","comments":{"nodes":[{"body":"which os? this state change exists on macOS as youre describing, and it theoretically should be the same on all platforms","author":{"login":"cjpais"}},{"body":"Windows 10.\r\nAnd thanks for your godsend project, great helper for people with RSI! ","author":{"login":"vkozio"}}]},"category":{"name":"Ideas"},"number":790,"createdAt":"2026-02-11T12:15:02Z"},{"title":"Handy crashes when using it in Alacritty + Opencode","body":"I love using Handy. It works in notepad, whatsapp, ... but when I try to use it in Opencode running in Alacritty, it crashes. Is anyone else experiencing this?","comments":{"nodes":[{"body":"what platform, and did you open it as admin","author":{"login":"cjpais"}},{"body":"Hi CJ, thank you for creating Handy, and thank you for helping me.  I'm on Windows 11, and Handy does indeed only crash when I run Alacritty as admin.","author":{"login":"johanvanmol"}}]},"category":{"name":"Q&A"},"number":786,"createdAt":"2026-02-11T10:23:45Z"},{"title":"Double-click icon in notification area to open settings","body":"When the app is minimized to the notification area, make double clicking it open the app like right-clicking and pressing Settings...","comments":{"nodes":[{"body":"See #369, I kicked off a test build, it should be ready to try in 15 minutes. Let me know and I will pull it in","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":766,"createdAt":"2026-02-10T13:45:47Z"},{"title":"Option to minimize to notification tray","body":"Minimizing the app currently just minimizes it. I would like an option to allow us to choose clicking minimize to function like the close button\r\n\r\ni.e. closing the settings and keeping the app in the notification area.","comments":{"nodes":[{"body":"PR's are welcome","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":767,"createdAt":"2026-02-10T13:49:35Z"},{"title":"Enable the ability to detect the current available typing methods and let the user choose which typing method to use instead hardcoded the default","body":"Hi, the wtype method currently is not working on Niri compositor but the dotool works. After playing with the app a little bit, I notice that there is no option to let me choose which typing tool to use. Can you consider add this options?\r\nMany thanks!","comments":{"nodes":[{"body":"A pr for this would be accepted","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":742,"createdAt":"2026-02-09T01:44:23Z"},{"title":"Transcription of all participants in the conversation","body":"Thanks for the great program!\r\nIs it possible to record and transcribe all the participants in the conversation? Now there is a recording and transcription of only my voice.","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":756,"createdAt":"2026-02-09T14:50:43Z"},{"title":"Transcription of all participants in the conversation","body":"Thanks for the great program!\r\nIs it possible to record and transcribe all the participants in the conversation? Now there is a recording and transcription of only my voice.","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":755,"createdAt":"2026-02-09T14:48:52Z"},{"title":"Is YNYNG LLC legit?","body":"Handy on v0.71 showed that an update is available. I triggered it but stumbled upon the YNYNG LLC as verified entity when prompted to enter my admin credentials. Is that legit? ","comments":{"nodes":[{"body":"Yes, it is my business. It's been around for a few years, which is required to get a valid code signing license from Microsoft","author":{"login":"cjpais"}}]},"category":{"name":"General"},"number":754,"createdAt":"2026-02-09T13:50:08Z"},{"title":"Multiple transcribe shortcuts pointing to different models","body":"I use Parakeet v3 and Whisper Turbo because each model has its tradeoff (e.g., Parakeet v3 is faster but doesn't support some of the languages I use such as Mandarin, while Whisper Turbo does but is slower).\r\n\r\nI can go in the UI and change the loaded model to do it, but it would be great if I could simply set a transcribe shortcut that would point to a specific model so I can immediately use both just by invoking the right keyboard shortcut.\r\n\r\nThanks!","comments":{"nodes":[{"body":"I would prefer to not add this complexity into the app, however there is a new model which will be in the next release which might be suitable for you (SenseVoice), it's very fast (faster than parakeet) and supports English and mandarin, I believe code switching as well","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":746,"createdAt":"2026-02-09T04:26:50Z"},{"title":"Add VAD Settings","body":"Hi! Many words missed in quiet speech/pauses due to VAD. Please add configurable sensitivity, min_silence_duration_ms, etc. Thanks!","comments":{"nodes":[{"body":"PR's welcome! Add it in debug and we can tune from there","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":743,"createdAt":"2026-02-09T02:45:16Z"},{"title":"Feature Request: Add completion sound when transcription finishes (accessibility improvement)","body":"Handy plays a sound when recording stops, but there’s no sound when the transcription actually finishes. Please add an optional “done” beep so users (especially blind/low-vision) know when the text is ready.\r\n","comments":{"nodes":[{"body":"@BlindMaster24 thank you for this feedback, especially for the accessibility use case, it will be added","author":{"login":"cjpais"}},{"body":"pc: https://github.com/cjpais/Handy/pull/734","author":{"login":"BlindMaster24"}},{"body":"@cjpais  I only now understood how bun checks works. 5 minutes and everything will be ready","author":{"login":"BlindMaster24"}},{"body":"done","author":{"login":"BlindMaster24"}}]},"category":{"name":"Ideas"},"number":732,"createdAt":"2026-02-07T21:30:06Z"},{"title":"How to switch the storage location to another non-C drive location?","body":"The model is not too small in size, and it is more expected to be stored on other SSDs(non-C drive location).","comments":{"nodes":[]},"category":{"name":"Q&A"},"number":730,"createdAt":"2026-02-07T05:47:19Z"},{"title":"Suggestion - order the available models in the post-processing window","body":"When querying the OpenAI API for available models, approx. 115 are returned. These seem to be displayed in, presumably, in the order they appear in the returned JSON. It can be quite hard to find the model you want amongst the unordered options.\r\n\r\n<img width=\"613\" height=\"556\" alt=\"image\" src=\"https://github.com/user-attachments/assets/eac347aa-653b-4aef-98a3-2e64ee898aa7\" />\r\n\r\n\r\nSuggest a very minor update to alphabetically order the models returned, to make it easier to find the one the user is looking for .","comments":{"nodes":[{"body":"Fwiw you can type in the box to narrow the results but yes we can sort them","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":727,"createdAt":"2026-02-06T15:58:05Z"},{"title":"Continiouse Translation - background transcribing process","body":"Hello,\r\n\r\ni want to suggest a continouse translation feature. What does this exaclity mean:\r\nthe user ist push to talk mode.\r\npresses the button and hold. talks. leaves the button and presses again without waiting for transcription processing. \r\nthe transcripition should be processed in the background and afterwards pasted next to the cursor but in the meantime the user can continue to speak the next sentences.\r\n\r\nsolution suggestion:\r\nrecord record and give the recorded media (like a pointer or a reference) into a pipeline to the transcriptoin process transcribes it and gives it to the next process (pasting process).\r\n\r\nI hope you understand what I mean.\r\n","comments":{"nodes":[{"body":"yes, i think this is true, but also there are some bugs/corner cases that come from this we should think about","author":{"login":"cjpais"}},{"body":"﻿the spamming of the key is only on the key lock process/thread. registers the recording start and end. the recording action in the record process itself relies only on this signals.the lock of the microphone is handled by the microphone thread.the finished record is handled to the next thread by pipe.FIFOthe transcripted text is pushed to the cursor by the last process.the end will release the memory space.everything of the memory space is managed together in a table row and each process has its own column to write into.this table is a global variable in the main app and in the single threads a reference. so you can create test cases.love it.Am 06.02.2026 um 14:57 schrieb CJ Pais ***@***.***>:﻿\r\nthinking about how to handling spamming of the key, making sure we are locking physical resources properly, etc... its probably worth looking at how the audio pipeline and keyboard shortcuts work generally, but yet all of it could be pipelined better for sure\r\n\r\n—Reply to this email directly, view it on GitHub, or unsubscribe.You are receiving this because you authored the thread.Message ID: ***@***.***>","author":{"login":"ThomasMeinzGroup"}}]},"category":{"name":"Ideas"},"number":725,"createdAt":"2026-02-06T12:29:17Z"},{"title":"npu (Neural Processing Unit) processing","body":"there is a npu in the new chipsets (https://en.wikipedia.org/wiki/Neural_processing_unit)\r\nProzessor: Intel(R) Core(TM) Ultra 7 255U or like this.\r\n\r\nwhy? because it is build for this kind of usecase. I hope about 4.3 time faster then gpu and 20 times faster then cpu but with no ressource usage of cpu and gpu.\r\n\r\nOverview about this topic: https://medium.com/@zlodeibaal/all-you-need-to-know-about-intel-npu-837ff5186423\r\n\r\na little bit more details for development on \r\nhttps://github.com/ellenhp/whisper-npu-server\r\nhttps://intel.github.io/intel-npu-acceleration-library/npu.html\r\nhttps://docs.openvino.ai/2025/openvino-workflow/running-inference/inference-devices-and-modes/npu-device.html\r\nhttps://docs.openvino.ai/2025/openvino-workflow/running-inference/inference-devices-and-modes/auto-device-selection.html\r\n","comments":{"nodes":[{"body":"PR's are welcome, I cannot easily support every type of acceleration. Even GPU support can be difficult, NPU will come when I have a chance or someone implements it. There are hundreds of NPU's","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":726,"createdAt":"2026-02-06T12:45:34Z"},{"title":"Handy crashes when loading Whisper Small on older Intel CPUs","body":"Hello!\r\n\r\nI’d like to describe in detail an issue I ran into while using the Handy app for voice recording and transcription on Windows.\r\n\r\n**System:**\r\n\r\n- OS: Windows 10 Pro (x64)\r\n- CPU: QuadCore Intel Core i7-950, 3200 MHz (24 x 133)\r\n- Instruction sets: MMX, SSE, SSE2, SSE3, SSSE3, SSE4.1, SSE4.2, EM64T, VT-x\r\n\r\nChatGPT suggested that the problem is most likely due to my CPU — it’s a desktop i7-950 from 2009, an older processor that supports AVX but not AVX2.\r\n\r\nHandy versions tested: 0.5.1 and 0.7.1\r\nI’m using the built-in model download feature through the Handy interface.\r\n\r\n**The issue**\r\n\r\nAfter installing and launching the app, I try to download the Whisper Small model through Handy’s interface. I also tried installing other Wisper models (Medium/Turbo). As soon as the model finishes downloading, the app immediately crashes. When I reopen it, the model’s green status indicator isn’t lit. If I try to start recording, the app crashes again right away. I’ve tried installing both the .exe and .msi versions — no difference.\r\n\r\nIf I delete the problematic model:\r\n\r\nHandy launches normally again. But as soon as I download the model again, the same issue happens\r\n\r\nWhat I’ve already tried\r\n\r\n- Completely deleting the models folder\r\n- Downloading models manually from Hugging Face\r\n- Trying different versions of the Small model\r\n- Checking file permissions\r\n- Launching from the terminal\r\n- Comparing model file sizes between Handy versions\r\n\r\nConclusion\r\n\r\nThe issue clearly seems related either to CPU incompatibility with the downloaded models, or to the way Handy loads/initializes them.\r\n\r\nIt looks like a situation where the model was built with AVX2/AVX512 support, while my CPU doesn’t support those instructions, causing the app to crash without any error message.\r\n\r\nIt’s also possible that:\r\n\r\nHandy doesn’t check model compatibility before loading\r\n\r\nOr it crashes during initialization of the whisper/parakeet backend\r\n\r\nI really like the idea behind Handy — especially the hotkeys and quick transcription insertion. It’s exactly what I need for my workflow, so I’d love to help figure out what’s causing this and hopefully get it fixed.\r\n\r\nThanks for developing Handy!","comments":{"nodes":[{"body":"Yep this is a known issue and I'd like to fix it!","author":{"login":"cjpais"}}]},"category":{"name":"Q&A"},"number":723,"createdAt":"2026-02-06T07:49:12Z"},{"title":"Support for direct input for GNOME on Wayland","body":"Hi, I'm trying to run Handy on GNOME on Wayland. There are two aspects:\r\n- The global keyboard shortcut not working as is and requiring the user to add a GNOME shortcut that sends a SIGUSR2 to Handy -> OK, not the goal of this issue\r\n- The direct typing input to GNOME -> Goal of this issue\r\n\r\nCurrently the ways to direct type on (non-KDE) Wayland [are](https://github.com/cjpais/Handy/blob/main/src-tauri/src/clipboard.rs#L132):\r\n- [wtype](https://github.com/atx/wtype), which uses [virtual_keyboard_unstable_v1](https://github.com/atx/wtype/blob/master/protocol/virtual-keyboard-unstable-v1.xml), which GNOME [does not support](https://absurdlysuspicious.github.io/wayland-protocols-table/)\r\n- [dotool](https://git.sr.ht/~geb/dotool) and [ydotool](https://github.com/ReimuNotMoe/ydotool), which do not support keyboard layouts (do not work when not in US layout), require to be added to the `input` group, and require a running socket, which is cumbresome\r\n\r\nOn the other hand, there would be two ways to add proper support for virtual typing to GNOME:\r\n- Using [XDG Desktop Portal Remote Desktop](https://flatpak.github.io/xdg-desktop-portal/docs/doc-org.freedesktop.portal.RemoteDesktop.html), exposed via D-Bus, which GNOME supports (and other compositors too, possibly)\r\n- Using a GNOME shell extension that calls Clutter (`Clutter.get_default_backend().get_default_seat().create_virtual_device(Clutter.InputDeviceType.KEYBOARD_DEVICE)`) to create a virtual device and then use it (but from my understanding, GNOME is moving to XDG Desktop Portal Remote Desktop). Requires a GNOME extension + only compatible with GNOME.\r\n\r\nSo I was originally thinking I could perhaps code a third-party bridge that would advertise a `virtual_keyboard_unstable_v1` compatible fake compositor to `wtype` that could then itself use the XDG Desktop Portal Remote Desktop API etc. but that would not be great:\r\n- Hard because need to create a fake compositor only for `wtype`\r\n- Need to pass the WAYLAND socket path to `wtype` but not to Handy itself...\r\n\r\nSo I see several solutions:\r\n- Enable Handy to directly talk to the XDG Desktop Portal Remote Desktop over D-Bus (no third-party dependencies, also would work not only on GNOME)\r\n- Enable Handy to run any user-specified command-line for its ouput (and then users could build some scripts to then push that to whatever their compositor accepts)\r\n- I write a `wtype`-like tool that talks XDG Desktop Portal Remote Desktop as its backend, then I make a PR to handy to add that as a \"typing backend\" alongside `wtype`\r\n\r\nWhat would you prefer?\r\n\r\n(Sorry for the long text :stuck_out_tongue:)","comments":{"nodes":[{"body":"Check the PRs I think they might have what you're looking for ;)","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":718,"createdAt":"2026-02-05T18:15:32Z"},{"title":"[FR] Add Mistral Voxtral Transcribe V2","body":"https://mistral.ai/news/voxtral-transcribe-2","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":716,"createdAt":"2026-02-05T14:32:35Z"},{"title":"Hey, what about adding Qwen3-ASR-1.7B and 0.6B to Handy?","body":"Hi @cjpais and folks!\r\nI've been really enjoying Handy — it's honestly one of the nicest local voice-control setups I've tried. Super responsive and feels natural.\r\nJust saw the new Qwen3-ASR models drop (late January 2026) and thought — these could be a sweet addition or even a nice alternative to the current Whisper setup.\r\nQuick highlights:\r\n\r\nThere's a strong 1.7B version that apparently beats most open-source ASR right now and even hangs with big commercial APIs in real-world tests.\r\nAnd a tiny fast 0.6B one — crazy efficient (like 2000× realtime at decent batch sizes, ~90 ms TTFT).\r\n\r\nWhat really caught my eye for Handy though is the built-in context support. You can just feed it extra text — keywords, app names, code snippets, jargon, whatever — and it biases the recognition heavily toward what you expect. For hands-free coding, config editing or using specific software this could make accuracy jump a lot. Whisper doesn't really have anything similar out of the box.\r\nOther cool bits: handles 52 languages/dialects with auto language detection, streaming + offline in one model, very good with noise/accents/fast speech/singing/long files.\r\nBoth are Apache 2.0, on HF here:\r\nhttps://huggingface.co/Qwen/Qwen3-ASR-1.7B\r\nhttps://huggingface.co/Qwen/Qwen3-ASR-0.6B\r\nRepo & inference code: https://github.com/QwenLM/Qwen3-ASR\r\n\r\nThe small one should run fine on modest hardware, the bigger one would shine on anything with a decent GPU.\r\nWhat do you think? Already looking at other new ASR stuff or is there a reason to stick with Whisper for now?\r\nThanks for building such a cool tool! 🚀","comments":{"nodes":[{"body":"Yes qwen ASR is really high on my list to support!","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":710,"createdAt":"2026-02-04T16:36:07Z"},{"title":"Disabling \".\" at the end of a message","body":"Option to Disable \".\" at the end of a message","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":714,"createdAt":"2026-02-05T07:24:46Z"},{"title":"I don't have audio sound","body":"Hi! I've been using Handy lately and I honestly love it, it's exactly what I was looking for. \r\n\r\nI'm on the latest version (v0.7.1) but for some reason, I can't see the \"Sound Theme\" option in my settings. I saw a screenshot in the discussions here where it shows up right above the Word Correction threshold, but it's just not there for me.\r\n\r\nRight now I don't get any sound at all when I press or release the key, so I'm never really sure if it's actually recording unless I'm looking directly at the HUD. Is this a known bug or maybe an OS thing?\r\n\r\nThanks for the great work!\r\n\r\n","comments":{"nodes":[{"body":"Have you opened the debug menu (cmd/ctrl+shift+d)\n\nRegarding the sound make you have audio feedback enabled. Maybe trying different output devices too. It's possible it has some issues as well","author":{"login":"cjpais"}}]},"category":{"name":"General"},"number":712,"createdAt":"2026-02-05T01:32:43Z"},{"title":"Not a big fan having shortcuts limited (by Tauri UI)","body":"I would simply want to make my shortcut ctrl + system, but the software won't let me.\r\n\r\nAlso, why not using a uniform and lighter UI system made in Rust just like the backend such as slint or dioxus (they would not interer with shortcuts at least)?","comments":{"nodes":[{"body":"You're welcome to write your own project. This is a work in progress and PRs are welcome. Criticism is not.","author":{"login":"cjpais"}}]},"category":{"name":"General"},"number":702,"createdAt":"2026-02-02T20:03:01Z"},{"title":"Model with Bangla/Bengali support","body":"The tool is working like magic for English and a few other languages but doesn't work for Bengali language. (Parakeet v3)\r\n\r\nI would like to know whether any of the existing models support Bengali, or which model I can add to enable Bengali support.\r\nThanks in advance.","comments":{"nodes":[]},"category":{"name":"Q&A"},"number":696,"createdAt":"2026-02-01T18:45:33Z"},{"title":"Regarding Punctuation and Formatting","body":"###### I'm new to Handy (and all speech to text software) so I might just be missing something obvious, but I searched the github repo and didn't see what I was looking for.\r\n\r\n**Is there a deterministic way to make Handy convert phrases like \"period\" or \"exclamation point\" or \"new line\" into punctuation and formatting rather than inserting literal strings?**\r\n\r\n> I see the post processing section where I could instruct an LLM to handle this, but I am wondering if there is a non-stochastic / non-AI way to explicitly make these changes instead of relying on an LLM to get it right and not alter the rest of the message?\r\n\r\n**I do not have experience with any of the voice recognition software that powers the backend of Handy, is this something that a configuration file could enable?**\r\n\r\nAny help would be greatly appreciated (and sorry if I've wasted anyone's time with such basic questions), have a wonderful day everyone, and thank you especially to the devs!","comments":{"nodes":[{"body":"Not currently. You certainly can try the experimental post processing feature\n\nThe best way would be inverse text normalization","author":{"login":"cjpais"}},{"body":"This would be something that would completely change the game. I used to use dragon and it had lots of strengths. In particular, the way you could just say things like open quotes, then close quotes, and it would just work. The Mac transcription software is far superior for accuracy, though. If there was some way of having a kind of dragon mode for handy, it would be really amazing. \r\nI have tried to implement it by having pushed a talk and then once I've said what I want to have transcribed, I use commands like enter that via command mode on the Mac and it sort of works, but it's a bit slow and doesn't always respond. ","author":{"login":"amaclullich"}}]},"category":{"name":"Q&A"},"number":662,"createdAt":"2026-01-25T06:54:06Z"},{"title":"Custom Phrases","body":"I love the ability to add custom words. So far those have been helpful both for company name and for abbreviations / initialisms. Sometimes, though, I want the ability to have custom phrases so I can indicate that a certain multi-part word or phrase is a proper noun and should be capitalized.","comments":{"nodes":[{"body":"I need this too, I would like that when I say \"Slash Think\" it translates to \"/think\" just setting up some mapping would be cool","author":{"login":"benedikt-schesch"}},{"body":"I think this would be nice as well, not only for things like \"slash think\" becoming /think but setting That specific audio is translated into specific text. I run into the issue that I have a friend named Nico. so I added that work to the custom word list. Now any time I say nice it writes Nico. Similar thing happens with a friend named Rin and it writing Rin anytime I say run or ran.","author":{"login":"SSlicer"}},{"body":"I had a similar idea. \r\nI use a +20yo keyboard because it has near 50 function and programmable keys that I have programmed with common phrases or email addresses, etc. Likewise on mobile I have short codes, three letter sequences, that do the same. \r\n\r\nI'd love to be able to do something similar with spoken phrases using Handy. For instance:\r\n- 'Insert business email'\r\n- 'Insert private email'\r\n- 'Insert spam email'\r\nOr record letter sequences that don't spell words to do much the same thing. For these I would record the phrases 'IBE', 'IPE', 'ISE', Which Handy has helpfully transcribed here as sequences of letters. \r\n\r\nI am now using Handy for the majority of my typing, excepting creative works, where the intermediate speed of typing aids in my future storytelling. Thank you, therefore, for creating such a useful tool that can be used offline, for continuing in its development, and providing it free of charge. Though I have, I admit, sent some funds your way. Many thanks. ","author":{"login":"topendediting"}}]},"category":{"name":"Ideas"},"number":601,"createdAt":"2026-01-16T14:28:37Z"},{"title":"Handy Review / Testimonial","body":"_Personally, I like to look at reviews or testimonials before I start using a software.  This wasn't an option with Handy, but I did like the look of the website and at the time was desperate to find something with its capabilities. For anyone else looking into Handy, this is my review:_\r\n\r\nI have been using Handy for three months, and in that time have transitioned to primarily using Handy for the majority of my procedural typing, such as rote client responses, emails, and simple non-technical text. From my handle you will note that I am a professional editor, so let me add this disclaimer - I refrain from using Handy to directly copy-edit client works, however, do use it within the comments. This is where rote responses comes into play. \r\n\r\nI am also a poet and creative writer, and have begun using it for poetry, and for some long-form articles. Though I don't currently use it for storytelling, where the intermediate speed of typing aids provides me time to think about future sentences, this is likely to change as I get more used to parsing sentences ahead of time. A caution here: I still need to proofread my work as hyphens are not automatically inserted and there are other punctuation issues. Select words may also need to be corrected, as I just noticed with the _parsing_, which transcribed as _passing_. Yes, I am using Handy to type this review.  \r\n\r\nI have also found Handy to be an extremely useful accessibility aid. I suffer from an illness that sometimes affects my motor function, meaning that while I may think and speak clearly, when I type, my fingers miss the correct keys, creating gobbledygook. So it was that I found Handy, during a particularly severe instance when I also had editing deadlines pressing. It was, if not a life, then certainly a job saver. \r\n\r\nAs an addendum, the support and development team is well versed in the product they are creating. I have had a couple of issues which have been speedily solved, and have been impressed by the continuing development of the product. \r\n\r\nThus, I highly recommend Handy as an offline transcription tool for use on both Windows and Linux (I don't know about Mac). I have used, or better said, attempted to use, many transcription tools over the years, including high-end models such as Dragon (when I was more financially solvent). This is by far the best, and I look forward to using it many years into the future.","comments":{"nodes":[]},"category":{"name":"General"},"number":683,"createdAt":"2026-01-29T05:19:55Z"},{"title":"Insert a space after the pasted input","body":"When dictating sentences individually, it would be desirable to have a space inserted at the end. Otherwise, the new sentence begins directly after the period of the previous sentence, requiring manual intervention. \r\n\r\nPerhaps a toggle option could be added to the options for this.\r\n\r\nOtherwise, some dictates would look like this: \"I was alone on the road.It was dark and cold.No cars and no people as far as the eyes could see.\"","comments":{"nodes":[{"body":"I see the argument, but just out of curiosity, don't we all transcribe with Ctrl + Space? I mean you could just hit space with the same finger you hold space with anyways..? Even if there was a toggle switch in the menu to turn on \"Insert Space at the end of transcription\", you wouldn't want to toggle it all the times you don't need that feature.\r\nHandy saved so much time for me already. I couldn't imagine this feature would actually save time to always go back into the app and toggle whenever you feel like you need it or you don't. (Just because your finger is on the Space anyways...) \r\nBut this should otherwise be a very easy implementation :)","author":{"login":"kbingoel"}},{"body":"No, I use ctrl+capslock, and I have capslock mapped to F12 for hotkey purposes. And even if I did trigger transcription with ctrl+space, that would be an extra button I'd need to press after every single sentence. \r\n\r\nIt shouldn't add a space after every transcription, but it should add one after every sentence, including if that sentence ends the transcription. ","author":{"login":"rodalpho"}},{"body":"I use Ctrl + End as a left handed guy. It would be great too for me :)","author":{"login":"rapapar"}},{"body":"Next release will have a switch to enable this feature","author":{"login":"cjpais"}},{"body":"Thank you for implementing this. I would like to show my support for having this feature in the regular menu instead of the debug menu. ","author":{"login":"Hyroniem"}}]},"category":{"name":"Ideas"},"number":223,"createdAt":"2025-10-18T16:13:56Z"},{"title":"Support SQL transcription.","body":"It would be pretty cool if handy could transcribe speech like the following into SQL: \r\n\r\n`select star from orders where ID equals one` => `select * from orders where id = 1`\r\n\r\nSome paid alternatives already support this, but it's hit and miss.\r\n\r\n","comments":{"nodes":[{"body":"try with llm post processing!","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":588,"createdAt":"2026-01-15T11:03:41Z"},{"title":"Maybe a better way forward than fixing whisper (VibeVoice-ASR)","body":"https://huggingface.co/microsoft/VibeVoice-ASR\r\n\r\nhttps://www.youtube.com/watch?v=BYPlfLQm0CQ&t=1441s","comments":{"nodes":[{"body":"This is a pretty big model and not really suited to most people without GPU's or lower end GPU's","author":{"login":"cjpais"}},{"body":"I guess the reality is that most people with low end hardware use SuperWhisper with their online models anyways. Parakeet is nice for what it is, but it's just not good enough for day to day usage. For casual conversations it might be okay, but it falls apart with technical terms or medical terms or languages other than English.\r\n\r\nNvidia also has these Canary models. Did you ever look into those? I think those can be run on a 12GB GPU at least. \r\n\r\nI think Whisper Large V3 Turbo with Vulkan backend is still very close and runs well on my AMD Ryzen 7 7840HS mini PC. It just barely works in handy. The advantage of the Whisper family is that there are many fine-tuned model variants for specific languages or particular industries. \r\n\r\nI don't know what way forward. Parakeet isn't quite ready for the real world. Whisper is broken. VibeVoice probably overkill. I think fixing Whisper and looking into the the Canary models might be the most promising, what do you think? ","author":{"login":"User-3090"}}]},"category":{"name":"Ideas"},"number":663,"createdAt":"2026-01-25T09:36:15Z"},{"title":"[FEATURE REQUEST] Ability to use cloud-based voice-to-text models via APIs","body":"Hi all,\r\n\r\nRecognizing that one of the main intentions behind developing Handy was to enable fully offline transcription, I believe that Handy is a great platform to go beyond offline models. If Handy were able to use cloud-based voice-to-text models, similar to current post-processing approach, user experience would greatly improve:\r\n\r\n1- Faster transcription: Current offline models take significant amount of time running on lower-spec hardware. I personally find it frustrating to wait for a transcription for a few minutes on my 2020 issued laptop. Using smaller models is not a viable option for me because as a non-us English speaker smaller models fail to understand my accent often.\r\n\r\n2- Better accuracy: I have found that cloud based models are much better at understanding my speech compared to current offline models used by Handy\r\n\r\nBest, Omer ","comments":{"nodes":[{"body":"You're welcome to fork and implement this, it will not come to handy","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":682,"createdAt":"2026-01-28T00:52:00Z"},{"title":"Support Monitoring the Clipboard/Screen with Accessibility the feed into TTS","body":"I'm interested in seeing if anyone using this app has an interest in the reverse flow?\r\n\r\nThe reverse would be either monitoring the clipboard or integrating with some sort of a Screen reading API and feeding the the resulting text or images into a small local LM that then then can be fed into a text to speech model for local playback.","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":681,"createdAt":"2026-01-27T16:22:38Z"},{"title":"Handy can translate?","body":"Thank you for your work. Does the application automatically translate from any language into the selected language when filling in the text input field?","comments":{"nodes":[{"body":"It can translate the selected language to English when using the whisper models\n\nIf you use the experimental post processing you can translate any language to any language","author":{"login":"cjpais"}}]},"category":{"name":"General"},"number":678,"createdAt":"2026-01-27T09:26:33Z"},{"title":"[Feature Request] Option to hide in tray when minimizaed or close","body":"> Currently once you open the main interface, it does not allow you to hide it in tray.\r\n\r\nSuggest to add a option \"**Hide to tray when close**\" or even better two options: \"**Hide to tray when minimized**\" and \"**Hide to tray when close**\".\r\n\r\nSo that you could always keep handy in standyby mode without it ocupy the limited taskbar space.","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":675,"createdAt":"2026-01-26T10:48:50Z"},{"title":"[New Feature] Meeting note function suggestion","body":"Currently the transcription will only start to process when release the key shortcut, it would be nice if it could add a new meeting notes transcription mode, asign a different key shortcut say S2, push S2 then entering the meeting notes transcription mode:\r\n**2 threads running at the same time, thread 1 for recording, thread 2 for transcription.**\r\n1. Creating a group or meeting subject, and all recording and transcription will be in the same project\r\n2. Start recording in thread 1\r\n3. After certain seconds, say 10s or a full sentance or a pause, pass the recording to thread 2 for transcription\r\n4. Repeat step 2,3\r\n5. After the meeting finished, there is a option to pass all the meeting note to LLM for a summary.  From [https://github.com/cjpais/Handy/discussions/599](url)\r\n\r\n### Key challenge \r\n- When to stop recording and pass to thread 2\r\n- Transcription result optimazation by processing the previous transcription and current one\r\n- Long term processing stability and result autosave.\r\n\r\nThere are others who already proposed something related with this but not the exact direction we are going:\r\nhttps://github.com/cjpais/Handy/discussions/599","comments":{"nodes":[{"body":"This is not going to happen in this project. Maybe a separate project which is more fundamentally designed to support multiple transcription options","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":668,"createdAt":"2026-01-25T18:14:34Z"},{"title":"[Feature Request] Add sound notification when transcription is complete","body":"**Description:**\r\n\r\nFirst of all, I want to give you a huge, HUGE thank you for this amazing project! 🎉\r\n\r\nI absolutely love Handy - it's honestly genius! I'm a big fan of Rust and Tauri myself, and what you've built here is incredible. It's just perfect that we don't have to waste time trying to code this ourselves or hunting for sketchy \"solutions\" on GitHub anymore. You've created something that just WORKS, and it works beautifully.\r\n\r\nI discovered Handy pretty early on, and I'm so thrilled to see how much it's grown! From the early days to now with over 13,000 GitHub stars - wow! You really deserve every single one of them. I'm genuinely so happy for you and the success this project has achieved. I use it every day and it's become an essential part of my workflow. 🙌\r\n\r\nI'm absolutely delighted I can contribute this feature request! I searched thoroughly through all the Issues and Discussions and I couldn't find anything similar anywhere, which honestly surprised me. I think this would be a quality of life improvement for many users.\r\n\r\nHere's the issue: currently, Handy plays a sound when you stop recording (when you release the shortcut key). That's great! But there's no audio feedback when the transcription itself is DONE processing.\r\n\r\nThe workflow right now is:\r\n1. Press shortcut → record audio\r\n2. Release shortcut → sound plays (recording stopped)\r\n3. Toast appears saying \"Transcript...\"\r\n4. Toast disappears → transcription is done but... NO SOUND!\r\n\r\nHere's my use case: sometimes the transcription takes ~20 seconds or more, especially with certain models. During that time, I could be doing other things on my computer! But instead, I'm forced to stare at that \"Transcript...\" toast, unable to do anything else, just waiting and waiting to see when it finally disappears so I know I can paste the text.\r\n\r\n**Proposed Solution:**\r\n\r\nAdd an optional audio notification (distinct from the recording stop sound) that plays when the transcription is fully completed and the text is ready! This would let me work on other things while Handy processes, and when I hear that \"ding\" or completion sound, I know exactly when to come back and paste the transcript.\r\n\r\n**Notes:**\r\n- This sound should be different from the recording stop sound so it's clear what just happened\r\n- Ideally make it configurable (enable/disable in settings, maybe custom sound file upload - see discussion #586 about sound themes!)\r\n- Would massively improve workflow efficiency\r\n\r\nThank you again for everything you've built! This project is absolutely fantastic and I'm proud to see it thrive and help so many people. 💪\r\n","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":666,"createdAt":"2026-01-25T17:38:23Z"},{"title":"[Feature Request] arm64 build for (mobile) Linux","body":"First off, thanks for making this wonderful application!  I've been using it for a couple of weeks on desktop linux and it's a delight to use something so small, targeted, and \"just works\" so well and elegantly.\r\n\r\nI'd love to be able to use this on the mobile linux smartphone I just bought.  It would be a real game changer to be able to use on-device STT on that platform.  Something that works in PHOSH would be ideal. \r\n\r\nThanks again for this wonderful app!  It's quickly become part of my desktop daily use case.","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":664,"createdAt":"2026-01-25T15:28:34Z"},{"title":"Auto update","body":"Add to the advanced menu Automatic update with a switch and when it is turned on, to automatically check for a new update and if there is one, update it instead of Check updates at the bottom and having to update it manually each time\r\n\r\n<img width=\"850\" height=\"713\" alt=\"image\" src=\"https://github.com/user-attachments/assets/2b0b6b8f-91bd-44f6-ba4d-869d107b151d\" />\r\n","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":658,"createdAt":"2026-01-24T13:30:52Z"},{"title":"[Feature Request] Have the overlay appear on the active screen in a multi monitor setup","body":"Right now it seems the overlay always appears on the main monitor in macOS 26.2. This is confusing over a long period of time as one is used to the overlay appearing when using handy. And this is then suddenly not the case if you work on secondary monitors. So this is a behavior that should be corrected and be dependent on the location of the input cursor. \r\n\r\nI'd be curious to hear whether this has been tackled before or whether it is very technically difficult, though I know that other programs with this functionality do have that feature. ","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":655,"createdAt":"2026-01-23T13:48:30Z"},{"title":"What about text to speech?","body":"Hey, I was wondering if any good _local_ text-to-speech tool exists? As a standalone program or a firefox/chrome extension?\r\nThat could come in very handy (😇) for reading articles. ","comments":{"nodes":[]},"category":{"name":"General"},"number":652,"createdAt":"2026-01-23T10:04:19Z"},{"title":"Post-processing Thinking Mode","body":"I’m really missing the ability to turn Thinking Mode on/off for models in Post-processing—at least for the custom provider.\r\nI'm loading the Ollama model glm-4.7-flash and I just need a quick response, instead of a long deliberation before answering.","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":651,"createdAt":"2026-01-23T08:53:49Z"},{"title":"PaperFlow - A supercharged fork of Handy!","body":"Hello @cjpais \r\n\r\nI made a little fork of Handy called PaperFlow :D\r\n<img width=\"2534\" height=\"1452\" alt=\"image\" src=\"https://github.com/user-attachments/assets/eecea4fe-77a0-4706-bf7f-3a4dab32a7b0\" />\r\n\r\nJust wanted to say—I genuinely couldn’t have built this without Handy. PaperFlow is completely based on it, and in many ways it’s just a supercharged take on the foundation you created.\r\n\r\nThank you for building something so clean and thoughtful. It made hacking on this an absolute joy <3\r\n\r\nP.S. Check it out here: https://github.com/solomonshalom/PaperFlow\r\n\r\nWould love to hear your thoughts!","comments":{"nodes":[]},"category":{"name":"Show and tell"},"number":647,"createdAt":"2026-01-22T19:05:01Z"},{"title":"Nix support","body":"I'd love to try out handy, but I'm running nixos so there's a few packaging aspects to sort out before I can run it locally. I started working on a nix derivation to build the project and I think I'm getting close, but I'm hung up on something with the ferrous-opencc build (or at least that's the one presenting). \r\n\r\nIf anyone knows how to address this, that'd be awesome! \r\n\r\n       > error: failed to run custom build command for `ferrous-opencc v0.2.3`\r\n       >\r\n       > Caused by:\r\n       >   process didn't exit successfully: `/build/9w0rgqa1d7kl5cr36wkhc9s3mnrxlka4-source/target/release/build/ferrous-opencc-5867813b9782d6a8/build-script-build` (exit status: 101)\r\n       >   --- stderr\r\n       >\r\n       >   thread 'main' (9943) panicked at /build/handy-0.7.0-vendor/ferrous-opencc-0.2.3/build.rs:94:10:\r\n       >   Unable to generate bindings: CargoMetadata(\"/build/handy-0.7.0-vendor/ferrous-opencc-0.2.3/Cargo.toml\", Metadata(Output { status: ExitStatus(unix_wait_status(25856)), stdout: \"\", stderr: \"error: failed to get `anyhow` as a dependency of package `ferrous-opencc v0.2.3 (/build/handy-0.7.0-vendor/ferrous-opencc-0.2.3)`\\n\\nCaused by:\\n  failed to load source for dependency `anyhow`\\n\\nCaused by:\\n  Unable to update registry `crates-io`\\n\\nCaused by:\\n  failed to update replaced source registry `crates-io`\\n\\nCaused by:\\n  failed to read root of directory source: /build/handy-0.7.0-vendor/@vendor@\\n\\nCaused by:\\n  No such file or directory (os error 2)\\n\" }))\r\n       >   note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace\r\n       > warning: build failed, waiting for other jobs to finish...\r\n       >        Error failed to build app: failed to build app\r\n\r\nMy WIP branch is here: https://github.com/zevisert/Handy/commit/4fa8cc5a4adcb6beed6e3027a16f42f7b55be868","comments":{"nodes":[{"body":"Try #561 and let me know how it goes","author":{"login":"cjpais"}}]},"category":{"name":"Show and tell"},"number":639,"createdAt":"2026-01-21T06:06:09Z"},{"title":"Adding kyutai's model support","body":"The French lab Kyutai is the world best for audio (TTS, STT, interactive dialog, voice cloning...)\r\n\r\nMay be adding one of these models could be a good idea (handle streaming):\r\nhttps://huggingface.co/kyutai/stt-1b-en_fr-candle\r\nhttps://huggingface.co/kyutai/stt-1b-en_fr\r\n\r\nFor the fun, you can try this: https://gradium.ai/#demo\r\nDo not hesitate to speak in order to \"interrupt\".","comments":{"nodes":[{"body":"For streaming, I guess it is better to use something like a media key without any modifier. Any modifier key could interact very badly with the application in push to talk mode.\r\nToggle mode can be an alternative, but you have to be sure that transcription is really finished before you push the modifier key, else it can do very strange things on the focused application.","author":{"login":"eiffel31"}}]},"category":{"name":"Ideas"},"number":635,"createdAt":"2026-01-20T15:04:46Z"},{"title":"Storage location for downloaded models","body":"Hi !\r\n\r\nBy default, downloaded models are stored in the user’s Library. In environments where multiple users log into the same machine, this leads to each account downloading its own copy of the models, which is not ideal in terms of disk usage.\r\n\r\nIt would be great to either provide an option in the interface that lets users choose the model storage location, or automatically detect and use a shared “models” directory located in the system Library (e.g. /Library/ApplicationSupport/com.pais.handy/models) if it exists.\r\n\r\nThanks for your work !","comments":{"nodes":[{"body":"Yeah I would like to fix this as well!","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":631,"createdAt":"2026-01-20T08:39:31Z"},{"title":"Mute all audio while listening.","body":"I think having an option that you can toggle on or off that forces audio to mute on the pc when handy is listening would be helpful. \r\n\r\nI personally use a single hotkey to dictate text. And I do it a lot when I'm doing something like watching somebody stream on Twitch. And then I run into the issue sometimes that, especially if my speaker is on, that Handy picks up what the person is saying and writes that down. So having the added feature of anytime Handy is listening to mute all of their audio would be nice.","comments":{"nodes":[{"body":"It exists in the debug menu and is moving to advanced in the next release \n\nctrl/cmd+shift+d","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":625,"createdAt":"2026-01-19T23:11:23Z"},{"title":"Best model to use for English speaker?","body":"I'm sure that all the models work with English speakers as long as you're speaking clearly, however I have a question.\r\n\r\nIs there a best model to use for English speakers? And by best I mean most accurate? Would someone maybe be willing to give a brief description or overview of each of the current models? Because I currently use the Parakeet Version 2 Model. However, on a whim, I tried using the Moonshine Base, and to the best of my knowledge and from what I've saw, they worked more or less the same?\r\nI guess the big questions I have regarding each model are as follows.\r\n\r\n- Which one is the most accurate for english speakers?\r\n- How big of a difference in response time is the fastest versus the slowest model? Since the two I tried seemingly were about the same speed.\r\n- Does a specific model give different results, such as if I say a number in one model, is it more likely to actually show up as numbers vs spelled out.\r\n- Does a specific model do better with more technical scientific speaking versus everyday communication, chatting, and maybe even slang?","comments":{"nodes":[]},"category":{"name":"Q&A"},"number":624,"createdAt":"2026-01-19T23:07:09Z"},{"title":"Feature Idea: Auto-discover custom Whisper models from models directory","body":"**Problem**\r\n\r\nThe built-in Whisper models don't handle certain languages well. In my case, I speak Chinese mixed with English, and I've been using\r\nhttps://huggingface.co/MediaTek-Research/Breeze-ASR-25 which handles this much better. Currently there's no way to use custom models without modifying source code.\r\n\r\n**Proposed Solution**\r\n\r\nAuto-discover custom Whisper .bin files from the models directory on startup. Just drop a file in, and it appears in the model selector.\r\n\r\n**Implementation**\r\n\r\nWorking implementation with tests in my fork:\r\nhttps://github.com/CJHwong/Handy/tree/feat/custom-whisper-model-discovery\r\n\r\n![Screenshot 2026-01-18 at 2 30 50 PM](https://github.com/user-attachments/assets/1f0b5194-9601-4fe4-b342-0da6ee62ab74)\r\n\r\n---\r\n\r\nWould this be useful to you?","comments":{"nodes":[{"body":"I agree, main problem I see is people complaining the model doesn't work and now I need to support it","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":609,"createdAt":"2026-01-18T07:20:10Z"},{"title":"Option to upload an audio file for local transcription","body":"Hi everyone 👋\r\n\r\nFirst off, thanks a lot for building Handy!! It’s such a great tool! I love how simple and fast it is, and the fact that everything runs locally is a huge plus.\r\n\r\nI had a small feature idea that could make it even more useful:\r\nit would be amazing if we could upload an audio file (like `.mp3`, `.wav`, `.m4a`, etc.) and get a full transcription directly inside Handy – still 100% offline, of course.\r\n\r\nRight now, Handy works perfectly for live speech-to-text through the microphone, but sometimes I already have a recording (for example, a voice memo, interview, or meeting) that I’d love to transcribe without using any online service.\r\n\r\nA simple “Upload audio file” button or drag-and-drop area would be great. The app could then process it locally and show the text (or let us copy it).\r\n\r\nAnyway, just wanted to share the idea – it feels like a natural next step for Handy, and I think a lot of people would use it.\r\nThanks again for all the work you’ve put into this project 🙏","comments":{"nodes":[{"body":"+1 for this feature\r\nAnd if it could do diarization, it would be top-notch!","author":{"login":"PhunkyBob"}},{"body":"If as well as or instead of \"upload/import audio\" a command line switch was possible\r\n\r\n```shell\r\nhandy my-audio.mp3 --output my-transcript.txt\r\n```","author":{"login":"NearlyUnique"}},{"body":"I've made a PR with a PoC for this feature #371 (only tested on Windows).  Diarization is not included in it yet, as I didnt want to drag in any new dependencies (and also because I have no clue how that works..) ","author":{"login":"olejsc"}},{"body":"It would also be awesome if we could setup directories to watch for this, for example, if I sync audio recordings from my phone then Handy automatically transcribes them. I'm sure there are lots of other usecases here.\r\n\r\nGreat work, love what you are doing!","author":{"login":"Drew-Macgibbon"}},{"body":"Overall the main feature of local transcription will be coming soon","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":299,"createdAt":"2025-11-04T08:16:27Z"},{"title":"Google's MedASR","body":"It's a bit complicated but any thoughts on implementing Google's MedASR especially with the n-gram KenLM model? It seems like have an LM predicting the next possible word increases accuracy. Also appears to be SOTA in medical transcription.","comments":{"nodes":[{"body":"please request in transcribe-rs!","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":619,"createdAt":"2026-01-19T02:16:26Z"},{"title":"GPU selection","body":"It would be great to add a feature in the ability to select a GPU on which the model will be deployed in systems with several GPUs. For example, I have a laptop where the AMD Radeon (4GB) video card is integrated, as well as the discrete Nvidia 3060 (6GB). Since the models are small, they can be deployed on the AMD video card, thus not interfering with the main video card which is used for other working purposes.\r\nThank you!","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":613,"createdAt":"2026-01-18T12:44:34Z"},{"title":"a11y config file / TUI","body":"This program targets devs interested in a11y. To that end, it would be nice to allow someone to configure the app using `vim`, or their text editor of choice. Presumably, you do store configs somewhere on disk already, so this may just be surfacing it as a first class citizen (eg look at how Kitty does it, the GUI launches vim on the config file).\r\n\r\nThere is also opportunity for a TUI to review recordings, switch models, etc. We could use Ink, blessed, textual, ncurses, whatever you want etc. if we made one.","comments":{"nodes":[{"body":"This is largely out of the scope of this project I think. It's mainly a desktop consumer app, not targeted at devs in particular.","author":{"login":"cjpais"}},{"body":"Fair enough, i figured storing settings in a text file (and allowing to edit that file from the gui too) would be non contentious. Maybe i framed it badly","author":{"login":"joshribakoff"}}]},"category":{"name":"Ideas"},"number":529,"createdAt":"2026-01-05T05:03:41Z"},{"title":"Feedback & Feature Requests: LLM Summarization and Speaker Diarization","body":"Hi @cjpais,\r\n\r\nFirst of all, thank you for this beautiful piece of software. I have been using WhisperX heavily in the past, but Handy covers a slightly different use case that WhisperX didn't: simplicity of configuration, ease of use, and the \"real-time\" aspect.\r\n\r\nI currently use Handy to generate personal notes directly into Obsidian, and to draft emails and articles. The ability to easily switch Audio Input (Microphone or Microsoft Teams) has opened new horizons for me, specifically for transcribing professional meetings.\r\n\r\nI wanted to share two ideas/requests to see if they fit within your scope:\r\n1. LLM Summarization (Reviewing Discussion #168)\r\n\r\nI read Discussion #168 regarding post-processing via LLM to clean up the transcript quality. I would be very interested if we could leverage that same \"pipeline\" to go beyond cleaning. Since the text is being sent to an LLM anyway, could we have an option to summarize or extract key points?\r\n\r\nUse case: After a Teams meeting, I’d get the raw transcript + a bullet-point summary to easely paste into Obsidian, mails.\r\nActually, I'm copy/pasting the transcript into local LLM (LM-Studio or Ollama) with a prompt for summarization, but for my friends that don’t have access or time to configure local LLM, this would be a great feature. But I’m not sure if this is something in scope for Handy.\r\n\r\n2. Speaker Diarization (Reviewing Discussion #299)\r\n\r\nI understand this is a complex feature, especially for a real-time tool, and it raises many technical challenges that I don't even imagine. However, coming from WhisperX, identifying who is speaking is the \"killer feature\" for meeting transcript. I am a big fan of the PyannoteAI models (like speaker-diarization-3.1 and recently community-1 used in the WhisperX pipeline).\r\n\r\n    Question: Is Diarization something you consider \"out of scope\" for Handy? Or could it perhaps be implemented as a post-processing step (processing the audio buffer after the recording stops) as an option ?\r\n\r\nSorry if I missed the normal usage of Handy but that is what I seems to be missing in my use case.\r\nThanks again for the great work, I use Handy everyday now and I feel more I control on my datas than with tools like Microsoft Teams). (sorry for my english, I use LLM for traduction). Best regards,","comments":{"nodes":[{"body":"## Regarding Speaker Diarization\r\n\r\nSince it is relevant for this discussion, and I also thought that including in #381 would be a bit overdo, I'll share my thoughts here:\r\n\r\nAbout this flow for post processing, since Handy already has a post processing feature and since this would be useful in multi-speaker scenarios.\r\n\r\n\r\n## Handy Transcription (already implemented as of now)\r\n\r\n1.  **Step 1: Transcription**\r\n    *   **Input:** Audio file.\r\n    *   **Action:** ASR model listens to the words.\r\n    *   **Output:** \"Hello everyone\" (Start: 0:00, End: 0:02).\r\n    *   *Note: Model has no idea who said this.*\r\n\r\n## Handy Post Processing - Speaker Diarization Flow\r\n\r\n2.  **Step 2: Diarization (The \"Speaker\" Model)**\r\n    *   **Input:** The same Audio file.\r\n    *   **Action:** This other model ignores the words and analyzes the **voice fingerprints**. It looks for tone, pitch, and pauses.\r\n    *   **Output:** \"Voice A spoke from 0:00 to 0:02.\" \"Voice B spoke from 0:03 to 0:05.\"\r\n\r\n3.  **Step 3: Alignment (The Merge)**\r\n    *   **Action:** The software looks at both outputs.\r\n    *   **Logic:** \"ASR model found text at 0:00. The Diarizer found Voice A at 0:00. Therefore, Voice A said that text.\"\r\n    *   **Final Result:** **[Speaker A]:** \"Hello everyone.\"\r\n\r\n\r\nBest models that handle diarization I found were:\r\n\r\nhttps://huggingface.co/pyannote/speaker-diarization-3.1\r\n\r\nhttps://huggingface.co/nvidia/diar_streaming_sortformer_4spk-v2.1","author":{"login":"jorgedanisc"}},{"body":"I love the excitement here, but generally Handy is focused on just a keyboard shortcut and speech to text. Other applications would be much better suited to what you're talking about I think, and most likely will not be implemented in Handy. There's a possibility for something like an extended version of Handy which rethinks everything based on the kinds of features that people most commonly request, but it will likely be its own application if I ever get around to making it.","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":599,"createdAt":"2026-01-16T10:15:35Z"},{"title":"New evdev input backend for Linux","body":"Would the project be open to an evdev (https://docs.rs/evdev/latest/evdev/) input backend?\r\n\r\nThis would remove the need for external tooling on Linux to provide keyboard input. Because it uses the Linux kernel’s evdev subsystem works in X11/Wayland and even on a console or any other graphical frontends.\r\n\r\nOnly requirement is the user has the group `input`.\r\n\r\nI've a spike of this code already if interested.","comments":{"nodes":[{"body":"Yes! That would be amazing!\n\nIf it's for global shortcuts, I'd love for it to be part of: https://github.com/handy-computer/handy-keys\n\nThis is what #580 is building on and is trying to address many outstanding issues with global shortcuts and would be great to fix Linux in there too\n\nIf it's for paste handling that is also great and just submit a PR!!","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":604,"createdAt":"2026-01-16T21:47:51Z"},{"title":"Support shortcuts without a main key","body":"I want my shortcut to be ctrl+optin+command (or any other combination without a main key), such that i can just smash the keyboard, unfortunately Handy doesnt support that :(","comments":{"nodes":[{"body":"Please try the build in #580 and let me know how it goes","author":{"login":"cjpais"}},{"body":"Works like a charm, thank you very much! ","author":{"login":"raphaelfff"}}]},"category":{"name":"Ideas"},"number":600,"createdAt":"2026-01-16T12:25:19Z"},{"title":"Copy last transcript from tray menu","body":"Problem\nIf the auto‑paste misses (focus changes, target app blocks input, etc.), there’s no quick way to recover the last output without opening Handy and going to History.\n\nWhy it matters\nThis is a small but frequent failure mode. A tray action provides an immediate recovery path from the menu bar and keeps the workflow lightweight.\n\nProposed solution\nAdd a tray menu item “Copy Last Transcript” that copies the most recent history entry. Prefer post‑processed text when available so the copied content matches the output the user actually saw.\n\nAlternatives considered\n- Rely on History tab only (slower + interrupts flow)\n- Add “Paste last transcript” (riskier; can paste into the wrong app)\n\nNotes\nI already have a working implementation and can open a PR once this discussion is approved.","comments":{"nodes":[{"body":"PR opened: https://github.com/cjpais/Handy/pull/598","author":{"login":"anntnzrb"}}]},"category":{"name":"Ideas"},"number":597,"createdAt":"2026-01-16T06:26:55Z"},{"title":"Just stopping by to say thank you. Thank you so much for this program. I use it every single day. Great job. Congratulations.","body":"Just stopping by to say thank you. Thank you so much for this program. I use it every single day. Great job. Congratulations.","comments":{"nodes":[{"body":"Let me chime in to say that I also love and use it every day! In fact, I used it to write this ;-)","author":{"login":"dscho"}},{"body":"<3","author":{"login":"cjpais"}},{"body":"I will also jump in here and add my thanks. As a new Linux Mint user who has really fallen in love with voice to text functionality, I really appreciate finding this excellent offering in the Linux world. I have also been a voice recognition user for twenty years, so I really appreciate when it's well done.\r\n\r\nAnd it's not just the accuracy of the transcription, it's also the accuracy of the punctuation as well. This is the first implementation of voice to text that has the automatic punctuation done so well. \r\n\r\nAnd to top it all off it runs quite nicely using the version two parakeet language model on my fourteen year old laptop! Extremely impressive.\r\n\r\nAnd of course, I am dictating this entire post using Handy. And I've only had to fix one hallucination over the course of this entire post, so that's just excellent. \r\n\r\nThanks again so much!","author":{"login":"mikenoname-github"}}]},"category":{"name":"General"},"number":577,"createdAt":"2026-01-13T11:39:05Z"},{"title":"Allow multiple modifiers as shortcut","body":"It is sometimes not so easy to find a simple and unused shortcut.\r\nThe proposal is to allow multiple modifiers as shortcut. For example using left shift + right shift could be an interesting key combination. Left control + right control could be good also,...","comments":{"nodes":[]},"category":{"name":"Ideas"},"number":593,"createdAt":"2026-01-15T22:13:21Z"},{"title":"Add more sound theme options","body":"Please add some more options as currently we are having just 2. Also, allowing user to upload their own audio files for the theme can be a good feature.\r\n<img width=\"732\" height=\"105\" alt=\"image\" src=\"https://github.com/user-attachments/assets/4591d4e0-4e46-434d-b79f-27b20f27c582\" />\r\n","comments":{"nodes":[{"body":"you're welcome to submit a pr","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":586,"createdAt":"2026-01-14T20:35:52Z"},{"title":"Add a dashboard with stats","body":"First of all thank you for this great software.\r\nAs in the title, one main thing missing is a dashboard. For example you can see in this screenshot of another speech-to-text software, it shows the stats and if you can add it to Handy, it will make it more interesting and fun to use.\r\n<img width=\"926\" height=\"626\" alt=\"image\" src=\"https://github.com/user-attachments/assets/ad7b02fb-71f9-4e02-a634-5b9eaaace4c9\" />\r\n","comments":{"nodes":[{"body":"This has gone through a review in the project already is not going to happen right now.","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":584,"createdAt":"2026-01-14T20:29:09Z"},{"title":"Add audio/video upload feature","body":"A new tab with option to upload audio/video file and see the transcription can be very useful. Sharing a reference screenshot of other similar software.\r\n\r\n<img width=\"935\" height=\"313\" alt=\"image\" src=\"https://github.com/user-attachments/assets/ad572f44-c203-4c91-8aac-7c858f2b93bb\" />\r\n","comments":{"nodes":[{"body":"See existing discussion on this: https://github.com/cjpais/Handy/discussions/299","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":585,"createdAt":"2026-01-14T20:32:19Z"},{"title":"Feature Request: Auto-Mute System Audio During Push-to-Talk","body":"Description\r\nAdd an option to automatically mute system audio when push-to-talk recording starts, and restore the previous volume level when recording stops.\r\nProblem\r\nWhen using push-to-talk while system audio is playing (music, videos, meeting audio, podcasts, etc.), the microphone picks up both my voice AND the audio from my laptop speakers. This results in:\r\n\r\nContaminated transcriptions that include unwanted audio (song lyrics, video dialogue, notification sounds)\r\nReduced transcription accuracy since Whisper/Parakeet has to filter through mixed audio\r\nUnexpected content appearing in transcriptions\r\n\r\nProposed Solution\r\nA toggle in Settings (e.g., \"Mute system audio while recording\") that:\r\n\r\nOn push-to-talk activation: Temporarily mutes system audio output\r\nOn push-to-talk release: Restores system audio to its previous volume level\r\n\r\nBenefits\r\n\r\nCleaner recordings - Only your voice is captured, no speaker bleed\r\nBetter transcription accuracy - Speech models work best with clean voice input\r\nPrivacy - Avoids accidentally transcribing content from videos/calls\r\nWorkflow improvement - Users can listen to music/podcasts and quickly dictate without manual muting\r\n\r\nUse Cases\r\n\r\nDictating notes while listening to background music\r\nQuick voice input during video calls (without capturing the call audio)\r\nTranscribing while watching tutorials or reference videos\r\n\r\nPlatform Considerations\r\nThis would need platform-specific implementations:\r\n\r\nmacOS: Core Audio APIs\r\nWindows: Windows Audio Session API (WASAPI)\r\nLinux: PulseAudio/PipeWire\r\n\r\nAdditional Context\r\nThis is similar to how some communication apps (Discord, Zoom) handle \"mute speakers during mic input\" functionality.\r\n","comments":{"nodes":[{"body":"This is implemented, check out the debug menu ctrl/cmd+shift+d \"mute while recording\"","author":{"login":"cjpais"}},{"body":"Amazing thanks! This is too useful to be in a hidden menu.","author":{"login":"JaviOverflow"}}]},"category":{"name":"Ideas"},"number":578,"createdAt":"2026-01-13T17:15:12Z"},{"title":"NixOS support","body":"Hello\r\n\r\nSince I'm on NixOS and I tried Handy today, can someone make it available in NixOS packages ( https://search.nixos.org/packages )","comments":{"nodes":[{"body":"yes please!","author":{"login":"Juanal07"}},{"body":"On it","author":{"login":"yyovil"}},{"body":"https://github.com/cjpais/Handy/pull/561","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":255,"createdAt":"2025-10-28T19:01:41Z"},{"title":"Let user decide how many recordings kept on disk","body":"I am using this to practice CELPIP and it's so great.\r\n\r\nBut it only keeps 5 audio files on disk and I wonder if this setting could be made modifiable and let user decide?","comments":{"nodes":[{"body":"Hey you can change this in the debug menu (cmd/ctrl+shift+d)","author":{"login":"cjpais"}}]},"category":{"name":"Ideas"},"number":566,"createdAt":"2026-01-11T10:39:21Z"}]}}}}